betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_tmr.h
} TMR_SlaveConfigTypeDef;

/**
  * @brief  TMR Break input(s) and Dead time configuration Structure definition
  * @note   2 break inputs can be configured (BKIN and BKIN2) with configurable
  *        filter and polarity.
  */
typedef struct
{
  uint32_t OffStateRunMode;      /*!< TMR off state in run mode, This parameter can be a value of @ref TMR_OSSR_Off_State_Selection_for_Run_mode_state */

  uint32_t OffStateIDLEMode;     /*!< TMR off state in IDLE mode, This parameter can be a value of @ref TMR_OSSI_Off_State_Selection_for_Idle_mode_state */

  uint32_t LockLevel;            /*!< TMR Lock level, This parameter can be a value of @ref TMR_Lock_level */

  uint32_t DeadTime;             /*!< TMR dead Time, This parameter can be a number between Min_Data = 0x00 and Max_Data = 0xFF */

  uint32_t BreakState;           /*!< TMR Break State, This parameter can be a value of @ref TMR_Break_Input_enable_disable */

  uint32_t BreakPolarity;        /*!< TMR Break input polarity, This parameter can be a value of @ref TMR_Break_Polarity */

  uint32_t BreakFilter;          /*!< Specifies the break input filter.This parameter can be a number between Min_Data = 0x0 and Max_Data = 0xF */

  uint32_t AutomaticOutput;      /*!< TMR Automatic Output Enable state, This parameter can be a value of @ref TMR_AOE_Bit_Set_Reset */

} TMR_BreakDeadTimeConfigTypeDef;

/**
  * @brief  DAL State structures definition
  */
typedef enum
{
  DAL_TMR_STATE_RESET             = 0x00U,    /*!< Peripheral not yet initialized or disabled  */
  DAL_TMR_STATE_READY             = 0x01U,    /*!< Peripheral Initialized and ready for use    */
  DAL_TMR_STATE_BUSY              = 0x02U,    /*!< An internal process is ongoing              */
  DAL_TMR_STATE_TIMEOUT           = 0x03U,    /*!< Timeout state                               */
  DAL_TMR_STATE_ERROR             = 0x04U     /*!< Reception process is ongoing                */
} DAL_TMR_StateTypeDef;

/**
  * @brief  TMR Channel States definition
  */
typedef enum
{
  DAL_TMR_CHANNEL_STATE_RESET             = 0x00U,    /*!< TMR Channel initial state                         */
  DAL_TMR_CHANNEL_STATE_READY             = 0x01U,    /*!< TMR Channel ready for use                         */
  DAL_TMR_CHANNEL_STATE_BUSY              = 0x02U,    /*!< An internal process is ongoing on the TMR channel */
} DAL_TMR_ChannelStateTypeDef;

/**
  * @brief  DMA Burst States definition
  */
typedef enum
{
  DAL_DMA_BURST_STATE_RESET             = 0x00U,    /*!< DMA Burst initial state */
  DAL_DMA_BURST_STATE_READY             = 0x01U,    /*!< DMA Burst ready for use */
  DAL_DMA_BURST_STATE_BUSY              = 0x02U,    /*!< Ongoing DMA Burst       */
} DAL_TMR_DMABurstStateTypeDef;

/**
  * @brief  DAL Active channel structures definition
  */
typedef enum
{
  DAL_TMR_ACTIVE_CHANNEL_1        = 0x01U,    /*!< The active channel is 1     */
  DAL_TMR_ACTIVE_CHANNEL_2        = 0x02U,    /*!< The active channel is 2     */
  DAL_TMR_ACTIVE_CHANNEL_3        = 0x04U,    /*!< The active channel is 3     */
  DAL_TMR_ACTIVE_CHANNEL_4        = 0x08U,    /*!< The active channel is 4     */
  DAL_TMR_ACTIVE_CHANNEL_CLEARED  = 0x00U     /*!< All active channels cleared */
} DAL_TMR_ActiveChannel;

/**
  * @brief  TMR Time Base Handle Structure definition
  */
#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
typedef struct __TMR_HandleTypeDef
#else
typedef struct
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
{
  TMR_TypeDef                        *Instance;         /*!< Register base address                             */
  TMR_Base_InitTypeDef               Init;              /*!< TMR Time Base required parameters                 */
  DAL_TMR_ActiveChannel              Channel;           /*!< Active channel                                    */
  DMA_HandleTypeDef                  *hdma[7];          /*!< DMA Handlers array
                                                             This array is accessed by a @ref DMA_Handle_index */
  DAL_LockTypeDef                    Lock;              /*!< Locking object                                    */
  __IO DAL_TMR_StateTypeDef          State;             /*!< TMR operation state                               */
  __IO DAL_TMR_ChannelStateTypeDef   ChannelState[4];   /*!< TMR channel operation state                       */
  __IO DAL_TMR_ChannelStateTypeDef   ChannelNState[4];  /*!< TMR complementary channel operation state         */
  __IO DAL_TMR_DMABurstStateTypeDef  DMABurstState;     /*!< DMA burst operation state                         */

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
  void (* Base_MspInitCallback)(struct __TMR_HandleTypeDef *htmr);              /*!< TMR Base Msp Init Callback                              */
  void (* Base_MspDeInitCallback)(struct __TMR_HandleTypeDef *htmr);            /*!< TMR Base Msp DeInit Callback                            */
  void (* IC_MspInitCallback)(struct __TMR_HandleTypeDef *htmr);                /*!< TMR IC Msp Init Callback                                */
  void (* IC_MspDeInitCallback)(struct __TMR_HandleTypeDef *htmr);              /*!< TMR IC Msp DeInit Callback                              */
  void (* OC_MspInitCallback)(struct __TMR_HandleTypeDef *htmr);                /*!< TMR OC Msp Init Callback                                */
  void (* OC_MspDeInitCallback)(struct __TMR_HandleTypeDef *htmr);              /*!< TMR OC Msp DeInit Callback                              */
  void (* PWM_MspInitCallback)(struct __TMR_HandleTypeDef *htmr);               /*!< TMR PWM Msp Init Callback                               */
  void (* PWM_MspDeInitCallback)(struct __TMR_HandleTypeDef *htmr);             /*!< TMR PWM Msp DeInit Callback                             */
  void (* OnePulse_MspInitCallback)(struct __TMR_HandleTypeDef *htmr);          /*!< TMR One Pulse Msp Init Callback                         */
  void (* OnePulse_MspDeInitCallback)(struct __TMR_HandleTypeDef *htmr);        /*!< TMR One Pulse Msp DeInit Callback                       */
  void (* Encoder_MspInitCallback)(struct __TMR_HandleTypeDef *htmr);           /*!< TMR Encoder Msp Init Callback                           */
  void (* Encoder_MspDeInitCallback)(struct __TMR_HandleTypeDef *htmr);         /*!< TMR Encoder Msp DeInit Callback                         */
  void (* HallSensor_MspInitCallback)(struct __TMR_HandleTypeDef *htmr);        /*!< TMR Hall Sensor Msp Init Callback                       */
  void (* HallSensor_MspDeInitCallback)(struct __TMR_HandleTypeDef *htmr);      /*!< TMR Hall Sensor Msp DeInit Callback                     */
  void (* PeriodElapsedCallback)(struct __TMR_HandleTypeDef *htmr);             /*!< TMR Period Elapsed Callback                             */
  void (* PeriodElapsedHalfCpltCallback)(struct __TMR_HandleTypeDef *htmr);     /*!< TMR Period Elapsed half complete Callback               */
  void (* TriggerCallback)(struct __TMR_HandleTypeDef *htmr);                   /*!< TMR Trigger Callback                                    */
  void (* TriggerHalfCpltCallback)(struct __TMR_HandleTypeDef *htmr);           /*!< TMR Trigger half complete Callback                      */
  void (* IC_CaptureCallback)(struct __TMR_HandleTypeDef *htmr);                /*!< TMR Input Capture Callback                              */
  void (* IC_CaptureHalfCpltCallback)(struct __TMR_HandleTypeDef *htmr);        /*!< TMR Input Capture half complete Callback                */
  void (* OC_DelayElapsedCallback)(struct __TMR_HandleTypeDef *htmr);           /*!< TMR Output Compare Delay Elapsed Callback               */
  void (* PWM_PulseFinishedCallback)(struct __TMR_HandleTypeDef *htmr);         /*!< TMR PWM Pulse Finished Callback                         */
  void (* PWM_PulseFinishedHalfCpltCallback)(struct __TMR_HandleTypeDef *htmr); /*!< TMR PWM Pulse Finished half complete Callback           */
  void (* ErrorCallback)(struct __TMR_HandleTypeDef *htmr);                     /*!< TMR Error Callback                                      */
  void (* CommutationCallback)(struct __TMR_HandleTypeDef *htmr);               /*!< TMR Commutation Callback                                */
  void (* CommutationHalfCpltCallback)(struct __TMR_HandleTypeDef *htmr);       /*!< TMR Commutation half complete Callback                  */
  void (* BreakCallback)(struct __TMR_HandleTypeDef *htmr);                     /*!< TMR Break Callback                                      */
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */
} TMR_HandleTypeDef;

#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
/**
  * @brief  DAL TMR Callback ID enumeration definition
  */
typedef enum
{
  DAL_TMR_BASE_MSPINIT_CB_ID              = 0x00U   /*!< TMR Base MspInit Callback ID                              */
  , DAL_TMR_BASE_MSPDEINIT_CB_ID          = 0x01U   /*!< TMR Base MspDeInit Callback ID                            */
  , DAL_TMR_IC_MSPINIT_CB_ID              = 0x02U   /*!< TMR IC MspInit Callback ID                                */
  , DAL_TMR_IC_MSPDEINIT_CB_ID            = 0x03U   /*!< TMR IC MspDeInit Callback ID                              */
  , DAL_TMR_OC_MSPINIT_CB_ID              = 0x04U   /*!< TMR OC MspInit Callback ID                                */
  , DAL_TMR_OC_MSPDEINIT_CB_ID            = 0x05U   /*!< TMR OC MspDeInit Callback ID                              */
  , DAL_TMR_PWM_MSPINIT_CB_ID             = 0x06U   /*!< TMR PWM MspInit Callback ID                               */
  , DAL_TMR_PWM_MSPDEINIT_CB_ID           = 0x07U   /*!< TMR PWM MspDeInit Callback ID                             */
  , DAL_TMR_ONE_PULSE_MSPINIT_CB_ID       = 0x08U   /*!< TMR One Pulse MspInit Callback ID                         */
  , DAL_TMR_ONE_PULSE_MSPDEINIT_CB_ID     = 0x09U   /*!< TMR One Pulse MspDeInit Callback ID                       */
  , DAL_TMR_ENCODER_MSPINIT_CB_ID         = 0x0AU   /*!< TMR Encoder MspInit Callback ID                           */
  , DAL_TMR_ENCODER_MSPDEINIT_CB_ID       = 0x0BU   /*!< TMR Encoder MspDeInit Callback ID                         */
  , DAL_TMR_HALL_SENSOR_MSPINIT_CB_ID     = 0x0CU   /*!< TMR Hall Sensor MspDeInit Callback ID                     */
  , DAL_TMR_HALL_SENSOR_MSPDEINIT_CB_ID   = 0x0DU   /*!< TMR Hall Sensor MspDeInit Callback ID                     */
  , DAL_TMR_PERIOD_ELAPSED_CB_ID          = 0x0EU   /*!< TMR Period Elapsed Callback ID                             */
  , DAL_TMR_PERIOD_ELAPSED_HALF_CB_ID     = 0x0FU   /*!< TMR Period Elapsed half complete Callback ID               */
  , DAL_TMR_TRIGGER_CB_ID                 = 0x10U   /*!< TMR Trigger Callback ID                                    */
  , DAL_TMR_TRIGGER_HALF_CB_ID            = 0x11U   /*!< TMR Trigger half complete Callback ID                      */

  , DAL_TMR_IC_CAPTURE_CB_ID              = 0x12U   /*!< TMR Input Capture Callback ID                              */
  , DAL_TMR_IC_CAPTURE_HALF_CB_ID         = 0x13U   /*!< TMR Input Capture half complete Callback ID                */
  , DAL_TMR_OC_DELAY_ELAPSED_CB_ID        = 0x14U   /*!< TMR Output Compare Delay Elapsed Callback ID               */
  , DAL_TMR_PWM_PULSE_FINISHED_CB_ID      = 0x15U   /*!< TMR PWM Pulse Finished Callback ID           */
  , DAL_TMR_PWM_PULSE_FINISHED_HALF_CB_ID = 0x16U   /*!< TMR PWM Pulse Finished half complete Callback ID           */
  , DAL_TMR_ERROR_CB_ID                   = 0x17U   /*!< TMR Error Callback ID                                      */
  , DAL_TMR_COMMUTATION_CB_ID             = 0x18U   /*!< TMR Commutation Callback ID                                */
  , DAL_TMR_COMMUTATION_HALF_CB_ID        = 0x19U   /*!< TMR Commutation half complete Callback ID                  */
  , DAL_TMR_BREAK_CB_ID                   = 0x1AU   /*!< TMR Break Callback ID                                      */
} DAL_TMR_CallbackIDTypeDef;

/**
  * @brief  DAL TMR Callback pointer definition
  */
typedef  void (*pTMR_CallbackTypeDef)(TMR_HandleTypeDef *htmr);  /*!< pointer to the TMR callback function */

#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */

/**
  * @}
  */
/* End of exported types -----------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup TMR_Exported_Constants TMR Exported Constants
  * @{
  */

/** @defgroup TMR_ClearInput_Source TMR Clear Input Source
  * @{
  */
#define TMR_CLEARINPUTSOURCE_NONE           0x00000000U   /*!< OCREF_CLR is disabled */
#define TMR_CLEARINPUTSOURCE_ETR            0x00000001U   /*!< OCREF_CLR is connected to ETRF input */
/**
  * @}
  */

/** @defgroup TMR_DMA_Base_address TMR DMA Base Address
  * @{
  */
#define TMR_DMABASE_CTRL1                   0x00000000U
#define TMR_DMABASE_CTRL2                   0x00000001U
#define TMR_DMABASE_SMCTRL                  0x00000002U
#define TMR_DMABASE_DIEN                    0x00000003U
#define TMR_DMABASE_STS                     0x00000004U
#define TMR_DMABASE_CEG                     0x00000005U
#define TMR_DMABASE_CCM1                    0x00000006U
#define TMR_DMABASE_CCM2                    0x00000007U
#define TMR_DMABASE_CCEN                    0x00000008U
#define TMR_DMABASE_CNT                     0x00000009U
#define TMR_DMABASE_PSC                     0x0000000AU
#define TMR_DMABASE_AUTORLD                 0x0000000BU
#define TMR_DMABASE_REPCNT                  0x0000000CU
#define TMR_DMABASE_CC1                     0x0000000DU
#define TMR_DMABASE_CC2                     0x0000000EU
#define TMR_DMABASE_CC3                     0x0000000FU
#define TMR_DMABASE_CC4                     0x00000010U
#define TMR_DMABASE_BDT                     0x00000011U
#define TMR_DMABASE_DCR                     0x00000012U
#define TMR_DMABASE_DMAR                    0x00000013U
/**
  * @}
  */

/** @defgroup TMR_Event_Source TMR Event Source
  * @{
  */
#define TMR_EVENTSOURCE_UPDATE              TMR_CEG_UEG     /*!< Reinitialize the counter and generates an update of the registers */
#define TMR_EVENTSOURCE_CC1                 TMR_CEG_CC1EG   /*!< A capture/compare event is generated on channel 1 */
#define TMR_EVENTSOURCE_CC2                 TMR_CEG_CC2EG   /*!< A capture/compare event is generated on channel 2 */
#define TMR_EVENTSOURCE_CC3                 TMR_CEG_CC3EG   /*!< A capture/compare event is generated on channel 3 */
#define TMR_EVENTSOURCE_CC4                 TMR_CEG_CC4EG   /*!< A capture/compare event is generated on channel 4 */
#define TMR_EVENTSOURCE_COM                 TMR_CEG_COMG    /*!< A commutation event is generated */
#define TMR_EVENTSOURCE_TRIGGER             TMR_CEG_TEG     /*!< A trigger event is generated */
#define TMR_EVENTSOURCE_BREAK               TMR_CEG_BEG     /*!< A break event is generated */
/**
  * @}
  */

/** @defgroup TMR_Input_Channel_Polarity TMR Input Channel polarity
  * @{
  */
#define  TMR_INPUTCHANNELPOLARITY_RISING      0x00000000U                           /*!< Polarity for TIx source */
#define  TMR_INPUTCHANNELPOLARITY_FALLING     TMR_CCEN_CC1POL                       /*!< Polarity for TIx source */
#define  TMR_INPUTCHANNELPOLARITY_BOTHEDGE    (TMR_CCEN_CC1POL | TMR_CCEN_CC1NPOL)  /*!< Polarity for TIx source */
/**
  * @}
  */

/** @defgroup TMR_ETR_Polarity TMR ETR Polarity
  * @{
  */
#define TMR_ETRPOLARITY_INVERTED              TMR_SMCTRL_ETPOL                  /*!< Polarity for ETR source */
#define TMR_ETRPOLARITY_NONINVERTED           0x00000000U                       /*!< Polarity for ETR source */
/**
  * @}
  */

/** @defgroup TMR_ETR_Prescaler TMR ETR Prescaler
  * @{
  */
#define TMR_ETRPRESCALER_DIV1                 0x00000000U                           /*!< No prescaler is used */
#define TMR_ETRPRESCALER_DIV2                 TMR_SMCTRL_ETPCFG_0                   /*!< ETR input source is divided by 2 */
#define TMR_ETRPRESCALER_DIV4                 TMR_SMCTRL_ETPCFG_1                   /*!< ETR input source is divided by 4 */
#define TMR_ETRPRESCALER_DIV8                 TMR_SMCTRL_ETPCFG                     /*!< ETR input source is divided by 8 */
/**
  * @}
  */

/** @defgroup TMR_Counter_Mode TMR Counter Mode
  * @{
  */
#define TMR_COUNTERMODE_UP                 0x00000000U                              /*!< Counter used as up-counter   */
#define TMR_COUNTERMODE_DOWN               TMR_CTRL1_CNTDIR                         /*!< Counter used as down-counter */
#define TMR_COUNTERMODE_CENTERALIGNED1     TMR_CTRL1_CAMSEL_0                       /*!< Center-aligned mode 1        */
#define TMR_COUNTERMODE_CENTERALIGNED2     TMR_CTRL1_CAMSEL_1                       /*!< Center-aligned mode 2        */
#define TMR_COUNTERMODE_CENTERALIGNED3     TMR_CTRL1_CAMSEL                         /*!< Center-aligned mode 3        */
/**
  * @}
  */

