betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_tmr.h
/** @defgroup TMR_ClockDivision TMR Clock Division
  * @{
  */
#define TMR_CLOCKDIVISION_DIV1             0x00000000U                              /*!< Clock division: tDTS=tCK_INT   */
#define TMR_CLOCKDIVISION_DIV2             TMR_CTRL1_CLKDIV_0                       /*!< Clock division: tDTS=2*tCK_INT */
#define TMR_CLOCKDIVISION_DIV4             TMR_CTRL1_CLKDIV_1                       /*!< Clock division: tDTS=4*tCK_INT */
/**
  * @}
  */

/** @defgroup TMR_Output_Compare_State TMR Output Compare State
  * @{
  */
#define TMR_OUTPUTSTATE_DISABLE            0x00000000U                            /*!< Capture/Compare 1 output disabled */
#define TMR_OUTPUTSTATE_ENABLE             TMR_CCEN_CC1EN                         /*!< Capture/Compare 1 output enabled */
/**
  * @}
  */

/** @defgroup TMR_AutoReloadPreload TMR Auto-Reload Preload
  * @{
  */
#define TMR_AUTORELOAD_PRELOAD_DISABLE                0x00000000U                 /*!< TMRx_ARR register is not buffered */
#define TMR_AUTORELOAD_PRELOAD_ENABLE                 TMR_CTRL1_ARPEN             /*!< TMRx_ARR register is buffered */

/**
  * @}
  */

/** @defgroup TMR_Output_Fast_State TMR Output Fast State
  * @{
  */
#define TMR_OCFAST_DISABLE                 0x00000000U                          /*!< Output Compare fast disable */
#define TMR_OCFAST_ENABLE                  TMR_CCM1_OC1FEN                      /*!< Output Compare fast enable  */
/**
  * @}
  */

/** @defgroup TMR_Output_Compare_N_State TMR Complementary Output Compare State
  * @{
  */
#define TMR_OUTPUTNSTATE_DISABLE           0x00000000U                            /*!< OCxN is disabled  */
#define TMR_OUTPUTNSTATE_ENABLE            TMR_CCEN_CC1NEN                        /*!< OCxN is enabled   */
/**
  * @}
  */

/** @defgroup TMR_Output_Compare_Polarity TMR Output Compare Polarity
  * @{
  */
#define TMR_OCPOLARITY_HIGH                0x00000000U                          /*!< Capture/Compare output polarity  */
#define TMR_OCPOLARITY_LOW                 TMR_CCEN_CC1POL                      /*!< Capture/Compare output polarity  */
/**
  * @}
  */

/** @defgroup TMR_Output_Compare_N_Polarity TMR Complementary Output Compare Polarity
  * @{
  */
#define TMR_OCNPOLARITY_HIGH               0x00000000U                          /*!< Capture/Compare complementary output polarity */
#define TMR_OCNPOLARITY_LOW                TMR_CCEN_CC1NPOL                     /*!< Capture/Compare complementary output polarity */
/**
  * @}
  */

/** @defgroup TMR_Output_Compare_Idle_State TMR Output Compare Idle State
  * @{
  */
#define TMR_OCIDLESTATE_SET                TMR_CTRL2_OC1OIS                     /*!< Output Idle state: OCx=1 when MOE=0 */
#define TMR_OCIDLESTATE_RESET              0x00000000U                          /*!< Output Idle state: OCx=0 when MOE=0 */
/**
  * @}
  */

/** @defgroup TMR_Output_Compare_N_Idle_State TMR Complementary Output Compare Idle State
  * @{
  */
#define TMR_OCNIDLESTATE_SET               TMR_CTRL2_OC1NOIS                    /*!< Complementary output Idle state: OCxN=1 when MOE=0 */
#define TMR_OCNIDLESTATE_RESET             0x00000000U                          /*!< Complementary output Idle state: OCxN=0 when MOE=0 */
/**
  * @}
  */

/** @defgroup TMR_Input_Capture_Polarity TMR Input Capture Polarity
  * @{
  */
#define  TMR_ICPOLARITY_RISING             TMR_INPUTCHANNELPOLARITY_RISING      /*!< Capture triggered by rising edge on timer input                  */
#define  TMR_ICPOLARITY_FALLING            TMR_INPUTCHANNELPOLARITY_FALLING     /*!< Capture triggered by falling edge on timer input                 */
#define  TMR_ICPOLARITY_BOTHEDGE           TMR_INPUTCHANNELPOLARITY_BOTHEDGE    /*!< Capture triggered by both rising and falling edges on timer input*/
/**
  * @}
  */

/** @defgroup TMR_Encoder_Input_Polarity TMR Encoder Input Polarity
  * @{
  */
#define  TMR_ENCODERINPUTPOLARITY_RISING   TMR_INPUTCHANNELPOLARITY_RISING      /*!< Encoder input with rising edge polarity  */
#define  TMR_ENCODERINPUTPOLARITY_FALLING  TMR_INPUTCHANNELPOLARITY_FALLING     /*!< Encoder input with falling edge polarity */
/**
  * @}
  */

/** @defgroup TMR_Input_Capture_Selection TMR Input Capture Selection
  * @{
  */
#define TMR_ICSELECTION_DIRECTTI           TMR_CCM1_CC1SEL_0                     /*!< TMR Input 1, 2, 3 or 4 is selected to be connected to IC1, IC2, IC3 or IC4, respectively */
#define TMR_ICSELECTION_INDIRECTTI         TMR_CCM1_CC1SEL_1                     /*!< TMR Input 1, 2, 3 or 4 is selected to be connected to IC2, IC1, IC4 or IC3, respectively */
#define TMR_ICSELECTION_TRC                TMR_CCM1_CC1SEL                       /*!< TMR Input 1, 2, 3 or 4 is selected to be connected to TRC */
/**
  * @}
  */

/** @defgroup TMR_Input_Capture_Prescaler TMR Input Capture Prescaler
  * @{
  */
#define TMR_ICPSC_DIV1                     0x00000000U                          /*!< Capture performed each time an edge is detected on the capture input */
#define TMR_ICPSC_DIV2                     TMR_CCM1_IC1PSC_0                    /*!< Capture performed once every 2 events                                */
#define TMR_ICPSC_DIV4                     TMR_CCM1_IC1PSC_1                    /*!< Capture performed once every 4 events                                */
#define TMR_ICPSC_DIV8                     TMR_CCM1_IC1PSC                      /*!< Capture performed once every 8 events                                */
/**
  * @}
  */

/** @defgroup TMR_One_Pulse_Mode TMR One Pulse Mode
  * @{
  */
#define TMR_OPMODE_SINGLE                  TMR_CTRL1_SPMEN                      /*!< Counter stops counting at the next update event */
#define TMR_OPMODE_REPETITIVE              0x00000000U                          /*!< Counter is not stopped at update event          */
/**
  * @}
  */

/** @defgroup TMR_Encoder_Mode TMR Encoder Mode
  * @{
  */
#define TMR_ENCODERMODE_TI1                      TMR_SMCTRL_SMFSEL_0                                                      /*!< Quadrature encoder mode 1, x2 mode, counts up/down on TI1FP1 edge depending on TI2FP2 level  */
#define TMR_ENCODERMODE_TI2                      TMR_SMCTRL_SMFSEL_1                                                      /*!< Quadrature encoder mode 2, x2 mode, counts up/down on TI2FP2 edge depending on TI1FP1 level. */
#define TMR_ENCODERMODE_TI12                     (TMR_SMCTRL_SMFSEL_1 | TMR_SMCTRL_SMFSEL_0)                                   /*!< Quadrature encoder mode 3, x4 mode, counts up/down on both TI1FP1 and TI2FP2 edges depending on the level of the other input. */
/**
  * @}
  */

/** @defgroup TMR_Interrupt_definition TMR interrupt Definition
  * @{
  */
#define TMR_IT_UPDATE                      TMR_DIEN_UIEN                        /*!< Update interrupt            */
#define TMR_IT_CC1                         TMR_DIEN_CC1IEN                      /*!< Capture/Compare 1 interrupt */
#define TMR_IT_CC2                         TMR_DIEN_CC2IEN                      /*!< Capture/Compare 2 interrupt */
#define TMR_IT_CC3                         TMR_DIEN_CC3IEN                      /*!< Capture/Compare 3 interrupt */
#define TMR_IT_CC4                         TMR_DIEN_CC4IEN                      /*!< Capture/Compare 4 interrupt */
#define TMR_IT_COM                         TMR_DIEN_COMIEN                      /*!< Commutation interrupt       */
#define TMR_IT_TRIGGER                     TMR_DIEN_TRGIEN                      /*!< Trigger interrupt           */
#define TMR_IT_BREAK                       TMR_DIEN_BRKIEN                      /*!< Break interrupt             */
/**
  * @}
  */

/** @defgroup TMR_Commutation_Source  TMR Commutation Source
  * @{
  */
#define TMR_COMMUTATION_TRGI              TMR_CTRL2_CCUSEL                      /*!< When Capture/compare control bits are preloaded, they are updated by setting the COMG bit or when an rising edge occurs on trigger input */
#define TMR_COMMUTATION_SOFTWARE          0x00000000U                           /*!< When Capture/compare control bits are preloaded, they are updated by setting the COMG bit */
/**
  * @}
  */

/** @defgroup TMR_DMA_sources TMR DMA Sources
  * @{
  */
#define TMR_DMA_UPDATE                     TMR_DIEN_UDIEN                       /*!< DMA request is triggered by the update event */
#define TMR_DMA_CC1                        TMR_DIEN_CC1DEN                      /*!< DMA request is triggered by the capture/compare macth 1 event */
#define TMR_DMA_CC2                        TMR_DIEN_CC2DEN                      /*!< DMA request is triggered by the capture/compare macth 2 event event */
#define TMR_DMA_CC3                        TMR_DIEN_CC3DEN                      /*!< DMA request is triggered by the capture/compare macth 3 event event */
#define TMR_DMA_CC4                        TMR_DIEN_CC4DEN                      /*!< DMA request is triggered by the capture/compare macth 4 event event */
#define TMR_DMA_COM                        TMR_DIEN_COMDEN                      /*!< DMA request is triggered by the commutation event */
#define TMR_DMA_TRIGGER                    TMR_DIEN_TRGDEN                      /*!< DMA request is triggered by the trigger event */
/**
  * @}
  */

/** @defgroup TMR_CC_DMA_Request CCx DMA request selection
  * @{
  */
#define TMR_CCDMAREQUEST_CC                 0x00000000U                         /*!< CCx DMA request sent when capture or compare match event occurs */
#define TMR_CCDMAREQUEST_UPDATE             TMR_CTRL2_CCDSEL                    /*!< CCx DMA requests sent when update event occurs */
/**
  * @}
  */

