betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_tmr.h
/** @defgroup TMR_Flag_definition TMR Flag Definition
  * @{
  */
#define TMR_FLAG_UPDATE                    TMR_STS_UIFLG                          /*!< Update interrupt flag         */
#define TMR_FLAG_CC1                       TMR_STS_CC1IFLG                        /*!< Capture/Compare 1 interrupt flag */
#define TMR_FLAG_CC2                       TMR_STS_CC2IFLG                        /*!< Capture/Compare 2 interrupt flag */
#define TMR_FLAG_CC3                       TMR_STS_CC3IFLG                        /*!< Capture/Compare 3 interrupt flag */
#define TMR_FLAG_CC4                       TMR_STS_CC4IFLG                        /*!< Capture/Compare 4 interrupt flag */
#define TMR_FLAG_COM                       TMR_STS_COMIFLG                        /*!< Commutation interrupt flag    */
#define TMR_FLAG_TRIGGER                   TMR_STS_TRGIFLG                        /*!< Trigger interrupt flag        */
#define TMR_FLAG_BREAK                     TMR_STS_BRKIFLG                        /*!< Break interrupt flag          */
#define TMR_FLAG_CC1OF                     TMR_STS_CC1RCFLG                       /*!< Capture 1 overcapture flag    */
#define TMR_FLAG_CC2OF                     TMR_STS_CC2RCFLG                       /*!< Capture 2 overcapture flag    */
#define TMR_FLAG_CC3OF                     TMR_STS_CC3RCFLG                       /*!< Capture 3 overcapture flag    */
#define TMR_FLAG_CC4OF                     TMR_STS_CC4RCFLG                       /*!< Capture 4 overcapture flag    */
/**
  * @}
  */

/** @defgroup TMR_Channel TMR Channel
  * @{
  */
#define TMR_CHANNEL_1                      0x00000000U                          /*!< Capture/compare channel 1 identifier      */
#define TMR_CHANNEL_2                      0x00000004U                          /*!< Capture/compare channel 2 identifier      */
#define TMR_CHANNEL_3                      0x00000008U                          /*!< Capture/compare channel 3 identifier      */
#define TMR_CHANNEL_4                      0x0000000CU                          /*!< Capture/compare channel 4 identifier      */
#define TMR_CHANNEL_ALL                    0x0000003CU                          /*!< Global Capture/compare channel identifier  */
/**
  * @}
  */

/** @defgroup TMR_Clock_Source TMR Clock Source
  * @{
  */
#define TMR_CLOCKSOURCE_INTERNAL    TMR_SMCTRL_ETPCFG_0   /*!< Internal clock source                                 */
#define TMR_CLOCKSOURCE_ETRMODE1    TMR_TS_ETRF           /*!< External clock source mode 1 (ETRF)                   */
#define TMR_CLOCKSOURCE_ETRMODE2    TMR_SMCTRL_ETPCFG_1   /*!< External clock source mode 2                          */
#define TMR_CLOCKSOURCE_TI1ED       TMR_TS_TI1F_ED        /*!< External clock source mode 1 (TTI1FP1 + edge detect.) */
#define TMR_CLOCKSOURCE_TI1         TMR_TS_TI1FP1         /*!< External clock source mode 1 (TTI1FP1)                */
#define TMR_CLOCKSOURCE_TI2         TMR_TS_TI2FP2         /*!< External clock source mode 1 (TTI2FP2)                */
#define TMR_CLOCKSOURCE_ITR0        TMR_TS_ITR0           /*!< External clock source mode 1 (ITR0)                   */
#define TMR_CLOCKSOURCE_ITR1        TMR_TS_ITR1           /*!< External clock source mode 1 (ITR1)                   */
#define TMR_CLOCKSOURCE_ITR2        TMR_TS_ITR2           /*!< External clock source mode 1 (ITR2)                   */
#define TMR_CLOCKSOURCE_ITR3        TMR_TS_ITR3           /*!< External clock source mode 1 (ITR3)                   */
/**
  * @}
  */

/** @defgroup TMR_Clock_Polarity TMR Clock Polarity
  * @{
  */
#define TMR_CLOCKPOLARITY_INVERTED           TMR_ETRPOLARITY_INVERTED           /*!< Polarity for ETRx clock sources */
#define TMR_CLOCKPOLARITY_NONINVERTED        TMR_ETRPOLARITY_NONINVERTED        /*!< Polarity for ETRx clock sources */
#define TMR_CLOCKPOLARITY_RISING             TMR_INPUTCHANNELPOLARITY_RISING    /*!< Polarity for TIx clock sources */
#define TMR_CLOCKPOLARITY_FALLING            TMR_INPUTCHANNELPOLARITY_FALLING   /*!< Polarity for TIx clock sources */
#define TMR_CLOCKPOLARITY_BOTHEDGE           TMR_INPUTCHANNELPOLARITY_BOTHEDGE  /*!< Polarity for TIx clock sources */
/**
  * @}
  */

/** @defgroup TMR_Clock_Prescaler TMR Clock Prescaler
  * @{
  */
#define TMR_CLOCKPRESCALER_DIV1                 TMR_ETRPRESCALER_DIV1           /*!< No prescaler is used                                                     */
#define TMR_CLOCKPRESCALER_DIV2                 TMR_ETRPRESCALER_DIV2           /*!< Prescaler for External ETR Clock: Capture performed once every 2 events. */
#define TMR_CLOCKPRESCALER_DIV4                 TMR_ETRPRESCALER_DIV4           /*!< Prescaler for External ETR Clock: Capture performed once every 4 events. */
#define TMR_CLOCKPRESCALER_DIV8                 TMR_ETRPRESCALER_DIV8           /*!< Prescaler for External ETR Clock: Capture performed once every 8 events. */
/**
  * @}
  */

/** @defgroup TMR_ClearInput_Polarity TMR Clear Input Polarity
  * @{
  */
#define TMR_CLEARINPUTPOLARITY_INVERTED           TMR_ETRPOLARITY_INVERTED      /*!< Polarity for ETRx pin */
#define TMR_CLEARINPUTPOLARITY_NONINVERTED        TMR_ETRPOLARITY_NONINVERTED   /*!< Polarity for ETRx pin */
/**
  * @}
  */

/** @defgroup TMR_ClearInput_Prescaler TMR Clear Input Prescaler
  * @{
  */
#define TMR_CLEARINPUTPRESCALER_DIV1              TMR_ETRPRESCALER_DIV1         /*!< No prescaler is used                                                   */
#define TMR_CLEARINPUTPRESCALER_DIV2              TMR_ETRPRESCALER_DIV2         /*!< Prescaler for External ETR pin: Capture performed once every 2 events. */
#define TMR_CLEARINPUTPRESCALER_DIV4              TMR_ETRPRESCALER_DIV4         /*!< Prescaler for External ETR pin: Capture performed once every 4 events. */
#define TMR_CLEARINPUTPRESCALER_DIV8              TMR_ETRPRESCALER_DIV8         /*!< Prescaler for External ETR pin: Capture performed once every 8 events. */
/**
  * @}
  */

/** @defgroup TMR_OSSR_Off_State_Selection_for_Run_mode_state TMR OSSR OffState Selection for Run mode state
  * @{
  */
#define TMR_OSSR_ENABLE                          TMR_BDT_RMOS                   /*!< When inactive, OC/OCN outputs are enabled (still controlled by the timer)           */
#define TMR_OSSR_DISABLE                         0x00000000U                    /*!< When inactive, OC/OCN outputs are disabled (not controlled any longer by the timer) */
/**
  * @}
  */

/** @defgroup TMR_OSSI_Off_State_Selection_for_Idle_mode_state TMR OSSI OffState Selection for Idle mode state
  * @{
  */
#define TMR_OSSI_ENABLE                          TMR_BDT_IMOS                   /*!< When inactive, OC/OCN outputs are enabled (still controlled by the timer)           */
#define TMR_OSSI_DISABLE                         0x00000000U                    /*!< When inactive, OC/OCN outputs are disabled (not controlled any longer by the timer) */
/**
  * @}
  */
/** @defgroup TMR_Lock_level  TMR Lock level
  * @{
  */
#define TMR_LOCKLEVEL_OFF                  0x00000000U                            /*!< LOCK OFF     */
#define TMR_LOCKLEVEL_1                    TMR_BDT_LOCKCFG_0                      /*!< LOCK Level 1 */
#define TMR_LOCKLEVEL_2                    TMR_BDT_LOCKCFG_1                      /*!< LOCK Level 2 */
#define TMR_LOCKLEVEL_3                    TMR_BDT_LOCKCFG                        /*!< LOCK Level 3 */
/**
  * @}
  */

/** @defgroup TMR_Break_Input_enable_disable TMR Break Input Enable
  * @{
  */
#define TMR_BREAK_ENABLE                   TMR_BDT_BRKEN                          /*!< Break input BRK is enabled  */
#define TMR_BREAK_DISABLE                  0x00000000U                            /*!< Break input BRK is disabled */
/**
  * @}
  */

