betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_tmr.h
/** @defgroup TMR_Break_Polarity TMR Break Input Polarity
  * @{
  */
#define TMR_BREAKPOLARITY_LOW              0x00000000U                            /*!< Break input BRK is active low  */
#define TMR_BREAKPOLARITY_HIGH             TMR_BDT_BRKPOL                         /*!< Break input BRK is active high */
/**
  * @}
  */

/** @defgroup TMR_AOE_Bit_Set_Reset TMR Automatic Output Enable
  * @{
  */
#define TMR_AUTOMATICOUTPUT_DISABLE        0x00000000U                          /*!< MOE can be set only by software */
#define TMR_AUTOMATICOUTPUT_ENABLE         TMR_BDT_AOEN                         /*!< MOE can be set by software or automatically at the next update event (if none of the break inputs BRK and BRK2 is active) */
/**
  * @}
  */

/** @defgroup TMR_Master_Mode_Selection TMR Master Mode Selection
  * @{
  */
#define TMR_TRGO_RESET            0x00000000U                                                 /*!< TMRx_EGR.UG bit is used as trigger output (TRGO)              */
#define TMR_TRGO_ENABLE           TMR_CTRL2_MMSEL_0                                           /*!< TMRx_CR1.CEN bit is used as trigger output (TRGO)             */
#define TMR_TRGO_UPDATE           TMR_CTRL2_MMSEL_1                                           /*!< Update event is used as trigger output (TRGO)                 */
#define TMR_TRGO_OC1              (TMR_CTRL2_MMSEL_1 | TMR_CTRL2_MMSEL_0)                     /*!< Capture or a compare match 1 is used as trigger output (TRGO) */
#define TMR_TRGO_OC1REF           TMR_CTRL2_MMSEL_2                                           /*!< OC1REF signal is used as trigger output (TRGO)                */
#define TMR_TRGO_OC2REF           (TMR_CTRL2_MMSEL_2 | TMR_CTRL2_MMSEL_0)                     /*!< OC2REF signal is used as trigger output(TRGO)                 */
#define TMR_TRGO_OC3REF           (TMR_CTRL2_MMSEL_2 | TMR_CTRL2_MMSEL_1)                     /*!< OC3REF signal is used as trigger output(TRGO)                 */
#define TMR_TRGO_OC4REF           (TMR_CTRL2_MMSEL_2 | TMR_CTRL2_MMSEL_1 | TMR_CTRL2_MMSEL_0) /*!< OC4REF signal is used as trigger output(TRGO)                 */
/**
  * @}
  */

/** @defgroup TMR_Master_Slave_Mode TMR Master/Slave Mode
  * @{
  */
#define TMR_MASTERSLAVEMODE_ENABLE         TMR_SMCTRL_MSMEN                     /*!< No action */
#define TMR_MASTERSLAVEMODE_DISABLE        0x00000000U                          /*!< Master/slave mode is selected */
/**
  * @}
  */

/** @defgroup TMR_Slave_Mode TMR Slave mode
  * @{
  */
#define TMR_SLAVEMODE_DISABLE                0x00000000U                                                        /*!< Slave mode disabled           */
#define TMR_SLAVEMODE_RESET                  TMR_SMCTRL_SMFSEL_2                                                /*!< Reset Mode                    */
#define TMR_SLAVEMODE_GATED                  (TMR_SMCTRL_SMFSEL_2 | TMR_SMCTRL_SMFSEL_0)                        /*!< Gated Mode                    */
#define TMR_SLAVEMODE_TRIGGER                (TMR_SMCTRL_SMFSEL_2 | TMR_SMCTRL_SMFSEL_1)                        /*!< Trigger Mode                  */
#define TMR_SLAVEMODE_EXTERNAL1              (TMR_SMCTRL_SMFSEL_2 | TMR_SMCTRL_SMFSEL_1 | TMR_SMCTRL_SMFSEL_0)  /*!< External Clock Mode 1         */
/**
  * @}
  */

/** @defgroup TMR_Output_Compare_and_PWM_modes TMR Output Compare and PWM Modes
  * @{
  */
#define TMR_OCMODE_TIMING                   0x00000000U                                                   /*!< Frozen                                 */
#define TMR_OCMODE_ACTIVE                   TMR_CCM1_OC1MOD_0                                             /*!< Set channel to active level on match   */
#define TMR_OCMODE_INACTIVE                 TMR_CCM1_OC1MOD_1                                             /*!< Set channel to inactive level on match */
#define TMR_OCMODE_TOGGLE                   (TMR_CCM1_OC1MOD_1 | TMR_CCM1_OC1MOD_0)                       /*!< Toggle                                 */
#define TMR_OCMODE_PWM1                     (TMR_CCM1_OC1MOD_2 | TMR_CCM1_OC1MOD_1)                       /*!< PWM mode 1                             */
#define TMR_OCMODE_PWM2                     (TMR_CCM1_OC1MOD_2 | TMR_CCM1_OC1MOD_1 | TMR_CCM1_OC1MOD_0)   /*!< PWM mode 2                             */
#define TMR_OCMODE_FORCED_ACTIVE            (TMR_CCM1_OC1MOD_2 | TMR_CCM1_OC1MOD_0)                       /*!< Force active level                     */
#define TMR_OCMODE_FORCED_INACTIVE          TMR_CCM1_OC1MOD_2                                             /*!< Force inactive level                   */
/**
  * @}
  */

/** @defgroup TMR_Trigger_Selection TMR Trigger Selection
  * @{
  */
#define TMR_TS_ITR0          0x00000000U                                                              /*!< Internal Trigger 0 (ITR0)              */
#define TMR_TS_ITR1          TMR_SMCTRL_TRGSEL_0                                                      /*!< Internal Trigger 1 (ITR1)              */
#define TMR_TS_ITR2          TMR_SMCTRL_TRGSEL_1                                                      /*!< Internal Trigger 2 (ITR2)              */
#define TMR_TS_ITR3          (TMR_SMCTRL_TRGSEL_0 | TMR_SMCTRL_TRGSEL_1)                              /*!< Internal Trigger 3 (ITR3)              */
#define TMR_TS_TI1F_ED       TMR_SMCTRL_TRGSEL_2                                                      /*!< TI1 Edge Detector (TI1F_ED)            */
#define TMR_TS_TI1FP1        (TMR_SMCTRL_TRGSEL_0 | TMR_SMCTRL_TRGSEL_2)                              /*!< Filtered Timer Input 1 (TI1FP1)        */
#define TMR_TS_TI2FP2        (TMR_SMCTRL_TRGSEL_1 | TMR_SMCTRL_TRGSEL_2)                              /*!< Filtered Timer Input 2 (TI2FP2)        */
#define TMR_TS_ETRF          (TMR_SMCTRL_TRGSEL_0 | TMR_SMCTRL_TRGSEL_1 | TMR_SMCTRL_TRGSEL_2)        /*!< Filtered External Trigger input (ETRF) */
#define TMR_TS_NONE          0x0000FFFFU                                                              /*!< No trigger selected                    */
/**
  * @}
  */

