betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_tmr.h
/** @defgroup TMR_Trigger_Polarity TMR Trigger Polarity
  * @{
  */
#define TMR_TRIGGERPOLARITY_INVERTED           TMR_ETRPOLARITY_INVERTED               /*!< Polarity for ETRx trigger sources             */
#define TMR_TRIGGERPOLARITY_NONINVERTED        TMR_ETRPOLARITY_NONINVERTED            /*!< Polarity for ETRx trigger sources             */
#define TMR_TRIGGERPOLARITY_RISING             TMR_INPUTCHANNELPOLARITY_RISING        /*!< Polarity for TIxFPx or TI1_ED trigger sources */
#define TMR_TRIGGERPOLARITY_FALLING            TMR_INPUTCHANNELPOLARITY_FALLING       /*!< Polarity for TIxFPx or TI1_ED trigger sources */
#define TMR_TRIGGERPOLARITY_BOTHEDGE           TMR_INPUTCHANNELPOLARITY_BOTHEDGE      /*!< Polarity for TIxFPx or TI1_ED trigger sources */
/**
  * @}
  */

/** @defgroup TMR_Trigger_Prescaler TMR Trigger Prescaler
  * @{
  */
#define TMR_TRIGGERPRESCALER_DIV1             TMR_ETRPRESCALER_DIV1             /*!< No prescaler is used                                                       */
#define TMR_TRIGGERPRESCALER_DIV2             TMR_ETRPRESCALER_DIV2             /*!< Prescaler for External ETR Trigger: Capture performed once every 2 events. */
#define TMR_TRIGGERPRESCALER_DIV4             TMR_ETRPRESCALER_DIV4             /*!< Prescaler for External ETR Trigger: Capture performed once every 4 events. */
#define TMR_TRIGGERPRESCALER_DIV8             TMR_ETRPRESCALER_DIV8             /*!< Prescaler for External ETR Trigger: Capture performed once every 8 events. */
/**
  * @}
  */

/** @defgroup TMR_TI1_Selection TMR TI1 Input Selection
  * @{
  */
#define TMR_TI1SELECTION_CH1               0x00000000U                          /*!< The TMRx_CH1 pin is connected to TI1 input */
#define TMR_TI1SELECTION_XORCOMBINATION    TMR_CTRL2_TI1SEL                     /*!< The TMRx_CH1, CH2 and CH3 pins are connected to the TI1 input (XOR combination) */
/**
  * @}
  */

/** @defgroup TMR_DMA_Burst_Length TMR DMA Burst Length
  * @{
  */
#define TMR_DMABURSTLENGTH_1TRANSFER       0x00000000U                          /*!< The transfer is done to 1 register starting from TMRx_CR1 + TMRx_DCR.DBA   */
#define TMR_DMABURSTLENGTH_2TRANSFERS      0x00000100U                          /*!< The transfer is done to 2 registers starting from TMRx_CR1 + TMRx_DCR.DBA  */
#define TMR_DMABURSTLENGTH_3TRANSFERS      0x00000200U                          /*!< The transfer is done to 3 registers starting from TMRx_CR1 + TMRx_DCR.DBA  */
#define TMR_DMABURSTLENGTH_4TRANSFERS      0x00000300U                          /*!< The transfer is done to 4 registers starting from TMRx_CR1 + TMRx_DCR.DBA  */
#define TMR_DMABURSTLENGTH_5TRANSFERS      0x00000400U                          /*!< The transfer is done to 5 registers starting from TMRx_CR1 + TMRx_DCR.DBA  */
#define TMR_DMABURSTLENGTH_6TRANSFERS      0x00000500U                          /*!< The transfer is done to 6 registers starting from TMRx_CR1 + TMRx_DCR.DBA  */
#define TMR_DMABURSTLENGTH_7TRANSFERS      0x00000600U                          /*!< The transfer is done to 7 registers starting from TMRx_CR1 + TMRx_DCR.DBA  */
#define TMR_DMABURSTLENGTH_8TRANSFERS      0x00000700U                          /*!< The transfer is done to 8 registers starting from TMRx_CR1 + TMRx_DCR.DBA  */
#define TMR_DMABURSTLENGTH_9TRANSFERS      0x00000800U                          /*!< The transfer is done to 9 registers starting from TMRx_CR1 + TMRx_DCR.DBA  */
#define TMR_DMABURSTLENGTH_10TRANSFERS     0x00000900U                          /*!< The transfer is done to 10 registers starting from TMRx_CR1 + TMRx_DCR.DBA */
#define TMR_DMABURSTLENGTH_11TRANSFERS     0x00000A00U                          /*!< The transfer is done to 11 registers starting from TMRx_CR1 + TMRx_DCR.DBA */
#define TMR_DMABURSTLENGTH_12TRANSFERS     0x00000B00U                          /*!< The transfer is done to 12 registers starting from TMRx_CR1 + TMRx_DCR.DBA */
#define TMR_DMABURSTLENGTH_13TRANSFERS     0x00000C00U                          /*!< The transfer is done to 13 registers starting from TMRx_CR1 + TMRx_DCR.DBA */
#define TMR_DMABURSTLENGTH_14TRANSFERS     0x00000D00U                          /*!< The transfer is done to 14 registers starting from TMRx_CR1 + TMRx_DCR.DBA */
#define TMR_DMABURSTLENGTH_15TRANSFERS     0x00000E00U                          /*!< The transfer is done to 15 registers starting from TMRx_CR1 + TMRx_DCR.DBA */
#define TMR_DMABURSTLENGTH_16TRANSFERS     0x00000F00U                          /*!< The transfer is done to 16 registers starting from TMRx_CR1 + TMRx_DCR.DBA */
#define TMR_DMABURSTLENGTH_17TRANSFERS     0x00001000U                          /*!< The transfer is done to 17 registers starting from TMRx_CR1 + TMRx_DCR.DBA */
#define TMR_DMABURSTLENGTH_18TRANSFERS     0x00001100U                          /*!< The transfer is done to 18 registers starting from TMRx_CR1 + TMRx_DCR.DBA */
/**
  * @}
  */

/** @defgroup DMA_Handle_index TMR DMA Handle Index
  * @{
  */
#define TMR_DMA_ID_UPDATE                ((uint16_t) 0x0000)       /*!< Index of the DMA handle used for Update DMA requests */
#define TMR_DMA_ID_CC1                   ((uint16_t) 0x0001)       /*!< Index of the DMA handle used for Capture/Compare 1 DMA requests */
#define TMR_DMA_ID_CC2                   ((uint16_t) 0x0002)       /*!< Index of the DMA handle used for Capture/Compare 2 DMA requests */
#define TMR_DMA_ID_CC3                   ((uint16_t) 0x0003)       /*!< Index of the DMA handle used for Capture/Compare 3 DMA requests */
#define TMR_DMA_ID_CC4                   ((uint16_t) 0x0004)       /*!< Index of the DMA handle used for Capture/Compare 4 DMA requests */
#define TMR_DMA_ID_COMMUTATION           ((uint16_t) 0x0005)       /*!< Index of the DMA handle used for Commutation DMA requests */
#define TMR_DMA_ID_TRIGGER               ((uint16_t) 0x0006)       /*!< Index of the DMA handle used for Trigger DMA requests */
/**
  * @}
  */

/** @defgroup Channel_CC_State TMR Capture/Compare Channel State
  * @{
  */
#define TMR_CCx_ENABLE                   0x00000001U                            /*!< Input or output channel is enabled */
#define TMR_CCx_DISABLE                  0x00000000U                            /*!< Input or output channel is disabled */
#define TMR_CCxN_ENABLE                  0x00000004U                            /*!< Complementary output channel is enabled */
#define TMR_CCxN_DISABLE                 0x00000000U                            /*!< Complementary output channel is enabled */
/**
  * @}
  */

/**
  * @}
  */
/* End of exported constants -------------------------------------------------*/

/* Exported macros -----------------------------------------------------------*/
/** @defgroup TMR_Exported_Macros TMR Exported Macros
  * @{
  */

/** @brief  Reset TMR handle state.
  * @param  __HANDLE__ TMR handle.
  * @retval None
  */
#if (USE_DAL_TMR_REGISTER_CALLBACKS == 1)
#define __DAL_TMR_RESET_HANDLE_STATE(__HANDLE__) do {                                                               \
                                                      (__HANDLE__)->State            = DAL_TMR_STATE_RESET;         \
                                                      (__HANDLE__)->ChannelState[0]  = DAL_TMR_CHANNEL_STATE_RESET; \
                                                      (__HANDLE__)->ChannelState[1]  = DAL_TMR_CHANNEL_STATE_RESET; \
                                                      (__HANDLE__)->ChannelState[2]  = DAL_TMR_CHANNEL_STATE_RESET; \
                                                      (__HANDLE__)->ChannelState[3]  = DAL_TMR_CHANNEL_STATE_RESET; \
                                                      (__HANDLE__)->ChannelNState[0] = DAL_TMR_CHANNEL_STATE_RESET; \
                                                      (__HANDLE__)->ChannelNState[1] = DAL_TMR_CHANNEL_STATE_RESET; \
                                                      (__HANDLE__)->ChannelNState[2] = DAL_TMR_CHANNEL_STATE_RESET; \
                                                      (__HANDLE__)->ChannelNState[3] = DAL_TMR_CHANNEL_STATE_RESET; \
                                                      (__HANDLE__)->DMABurstState    = DAL_DMA_BURST_STATE_RESET;   \
                                                      (__HANDLE__)->Base_MspInitCallback         = NULL;            \
                                                      (__HANDLE__)->Base_MspDeInitCallback       = NULL;            \
                                                      (__HANDLE__)->IC_MspInitCallback           = NULL;            \
                                                      (__HANDLE__)->IC_MspDeInitCallback         = NULL;            \
                                                      (__HANDLE__)->OC_MspInitCallback           = NULL;            \
                                                      (__HANDLE__)->OC_MspDeInitCallback         = NULL;            \
                                                      (__HANDLE__)->PWM_MspInitCallback          = NULL;            \
                                                      (__HANDLE__)->PWM_MspDeInitCallback        = NULL;            \
                                                      (__HANDLE__)->OnePulse_MspInitCallback     = NULL;            \
                                                      (__HANDLE__)->OnePulse_MspDeInitCallback   = NULL;            \
                                                      (__HANDLE__)->Encoder_MspInitCallback      = NULL;            \
                                                      (__HANDLE__)->Encoder_MspDeInitCallback    = NULL;            \
                                                      (__HANDLE__)->HallSensor_MspInitCallback   = NULL;            \
                                                      (__HANDLE__)->HallSensor_MspDeInitCallback = NULL;            \
                                                     } while(0)
#else
#define __DAL_TMR_RESET_HANDLE_STATE(__HANDLE__) do {                                                               \
                                                      (__HANDLE__)->State            = DAL_TMR_STATE_RESET;         \
                                                      (__HANDLE__)->ChannelState[0]  = DAL_TMR_CHANNEL_STATE_RESET; \
                                                      (__HANDLE__)->ChannelState[1]  = DAL_TMR_CHANNEL_STATE_RESET; \
                                                      (__HANDLE__)->ChannelState[2]  = DAL_TMR_CHANNEL_STATE_RESET; \
                                                      (__HANDLE__)->ChannelState[3]  = DAL_TMR_CHANNEL_STATE_RESET; \
                                                      (__HANDLE__)->ChannelNState[0] = DAL_TMR_CHANNEL_STATE_RESET; \
                                                      (__HANDLE__)->ChannelNState[1] = DAL_TMR_CHANNEL_STATE_RESET; \
                                                      (__HANDLE__)->ChannelNState[2] = DAL_TMR_CHANNEL_STATE_RESET; \
                                                      (__HANDLE__)->ChannelNState[3] = DAL_TMR_CHANNEL_STATE_RESET; \
                                                      (__HANDLE__)->DMABurstState    = DAL_DMA_BURST_STATE_RESET;   \
                                                     } while(0)
#endif /* USE_DAL_TMR_REGISTER_CALLBACKS */

/**
  * @brief  Enable the TMR peripheral.
  * @param  __HANDLE__ TMR handle
  * @retval None
  */
#define __DAL_TMR_ENABLE(__HANDLE__)                 ((__HANDLE__)->Instance->CTRL1|=(TMR_CTRL1_CNTEN))

/**
  * @brief  Enable the TMR main Output.
  * @param  __HANDLE__ TMR handle
  * @retval None
  */
#define __DAL_TMR_MOE_ENABLE(__HANDLE__)             ((__HANDLE__)->Instance->BDT|=(TMR_BDT_MOEN))

/**
  * @brief  Disable the TMR peripheral.
  * @param  __HANDLE__ TMR handle
  * @retval None
  */
#define __DAL_TMR_DISABLE(__HANDLE__) \
  do { \
    if (((__HANDLE__)->Instance->CCEN & TMR_CCEN_CCxE_MASK) == 0UL) \
    { \
      if(((__HANDLE__)->Instance->CCEN & TMR_CCEN_CCxNE_MASK) == 0UL) \
      { \
        (__HANDLE__)->Instance->CTRL1 &= ~(TMR_CTRL1_CNTEN); \
      } \
    } \
  } while(0)

/**
  * @brief  Disable the TMR main Output.
  * @param  __HANDLE__ TMR handle
  * @retval None
  * @note The Main Output Enable of a timer instance is disabled only if all the CCx and CCxN channels have been
  *       disabled
  */
#define __DAL_TMR_MOE_DISABLE(__HANDLE__) \
  do { \
    if (((__HANDLE__)->Instance->CCEN & TMR_CCEN_CCxE_MASK) == 0UL) \
    { \
      if(((__HANDLE__)->Instance->CCEN & TMR_CCEN_CCxNE_MASK) == 0UL) \
      { \
        (__HANDLE__)->Instance->BDT &= ~(TMR_BDT_MOEN); \
      } \
    } \
  } while(0)

/**
  * @brief  Disable the TMR main Output.
  * @param  __HANDLE__ TMR handle
  * @retval None
  * @note The Main Output Enable of a timer instance is disabled unconditionally
  */
#define __DAL_TMR_MOE_DISABLE_UNCONDITIONALLY(__HANDLE__)  (__HANDLE__)->Instance->BDT &= ~(TMR_BDT_MOEN)

/** @brief  Enable the specified TMR interrupt.
  * @param  __HANDLE__ specifies the TMR Handle.
  * @param  __INTERRUPT__ specifies the TMR interrupt source to enable.
  *          This parameter can be one of the following values:
  *            @arg TMR_IT_UPDATE: Update interrupt
  *            @arg TMR_IT_CC1:   Capture/Compare 1 interrupt
  *            @arg TMR_IT_CC2:  Capture/Compare 2 interrupt
  *            @arg TMR_IT_CC3:  Capture/Compare 3 interrupt
  *            @arg TMR_IT_CC4:  Capture/Compare 4 interrupt
  *            @arg TMR_IT_COM:   Commutation interrupt
  *            @arg TMR_IT_TRIGGER: Trigger interrupt
  *            @arg TMR_IT_BREAK: Break interrupt
  * @retval None
  */
#define __DAL_TMR_ENABLE_IT(__HANDLE__, __INTERRUPT__)    ((__HANDLE__)->Instance->DIEN |= (__INTERRUPT__))

/** @brief  Disable the specified TMR interrupt.
  * @param  __HANDLE__ specifies the TMR Handle.
  * @param  __INTERRUPT__ specifies the TMR interrupt source to disable.
  *          This parameter can be one of the following values:
  *            @arg TMR_IT_UPDATE: Update interrupt
  *            @arg TMR_IT_CC1:   Capture/Compare 1 interrupt
  *            @arg TMR_IT_CC2:  Capture/Compare 2 interrupt
  *            @arg TMR_IT_CC3:  Capture/Compare 3 interrupt
  *            @arg TMR_IT_CC4:  Capture/Compare 4 interrupt
  *            @arg TMR_IT_COM:   Commutation interrupt
  *            @arg TMR_IT_TRIGGER: Trigger interrupt
  *            @arg TMR_IT_BREAK: Break interrupt
  * @retval None
  */
#define __DAL_TMR_DISABLE_IT(__HANDLE__, __INTERRUPT__)   ((__HANDLE__)->Instance->DIEN &= ~(__INTERRUPT__))

/** @brief  Enable the specified DMA request.
  * @param  __HANDLE__ specifies the TMR Handle.
  * @param  __DMA__ specifies the TMR DMA request to enable.
  *          This parameter can be one of the following values:
  *            @arg TMR_DMA_UPDATE: Update DMA request
  *            @arg TMR_DMA_CC1:   Capture/Compare 1 DMA request
  *            @arg TMR_DMA_CC2:  Capture/Compare 2 DMA request
  *            @arg TMR_DMA_CC3:  Capture/Compare 3 DMA request
  *            @arg TMR_DMA_CC4:  Capture/Compare 4 DMA request
  *            @arg TMR_DMA_COM:   Commutation DMA request
  *            @arg TMR_DMA_TRIGGER: Trigger DMA request
  * @retval None
  */
#define __DAL_TMR_ENABLE_DMA(__HANDLE__, __DMA__)         ((__HANDLE__)->Instance->DIEN |= (__DMA__))

