betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_tmr.h
/** @brief  Disable the specified DMA request.
  * @param  __HANDLE__ specifies the TMR Handle.
  * @param  __DMA__ specifies the TMR DMA request to disable.
  *          This parameter can be one of the following values:
  *            @arg TMR_DMA_UPDATE: Update DMA request
  *            @arg TMR_DMA_CC1:   Capture/Compare 1 DMA request
  *            @arg TMR_DMA_CC2:  Capture/Compare 2 DMA request
  *            @arg TMR_DMA_CC3:  Capture/Compare 3 DMA request
  *            @arg TMR_DMA_CC4:  Capture/Compare 4 DMA request
  *            @arg TMR_DMA_COM:   Commutation DMA request
  *            @arg TMR_DMA_TRIGGER: Trigger DMA request
  * @retval None
  */
#define __DAL_TMR_DISABLE_DMA(__HANDLE__, __DMA__)        ((__HANDLE__)->Instance->DIEN &= ~(__DMA__))

/** @brief  Check whether the specified TMR interrupt flag is set or not.
  * @param  __HANDLE__ specifies the TMR Handle.
  * @param  __FLAG__ specifies the TMR interrupt flag to check.
  *        This parameter can be one of the following values:
  *            @arg TMR_FLAG_UPDATE: Update interrupt flag
  *            @arg TMR_FLAG_CC1: Capture/Compare 1 interrupt flag
  *            @arg TMR_FLAG_CC2: Capture/Compare 2 interrupt flag
  *            @arg TMR_FLAG_CC3: Capture/Compare 3 interrupt flag
  *            @arg TMR_FLAG_CC4: Capture/Compare 4 interrupt flag
  *            @arg TMR_FLAG_COM:  Commutation interrupt flag
  *            @arg TMR_FLAG_TRIGGER: Trigger interrupt flag
  *            @arg TMR_FLAG_BREAK: Break interrupt flag
  *            @arg TMR_FLAG_CC1OF: Capture/Compare 1 overcapture flag
  *            @arg TMR_FLAG_CC2OF: Capture/Compare 2 overcapture flag
  *            @arg TMR_FLAG_CC3OF: Capture/Compare 3 overcapture flag
  *            @arg TMR_FLAG_CC4OF: Capture/Compare 4 overcapture flag
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#define __DAL_TMR_GET_FLAG(__HANDLE__, __FLAG__)          (((__HANDLE__)->Instance->STS &(__FLAG__)) == (__FLAG__))

/** @brief  Clear the specified TMR interrupt flag.
  * @param  __HANDLE__ specifies the TMR Handle.
  * @param  __FLAG__ specifies the TMR interrupt flag to clear.
  *        This parameter can be one of the following values:
  *            @arg TMR_FLAG_UPDATE: Update interrupt flag
  *            @arg TMR_FLAG_CC1: Capture/Compare 1 interrupt flag
  *            @arg TMR_FLAG_CC2: Capture/Compare 2 interrupt flag
  *            @arg TMR_FLAG_CC3: Capture/Compare 3 interrupt flag
  *            @arg TMR_FLAG_CC4: Capture/Compare 4 interrupt flag
  *            @arg TMR_FLAG_COM:  Commutation interrupt flag
  *            @arg TMR_FLAG_TRIGGER: Trigger interrupt flag
  *            @arg TMR_FLAG_BREAK: Break interrupt flag
  *            @arg TMR_FLAG_CC1OF: Capture/Compare 1 overcapture flag
  *            @arg TMR_FLAG_CC2OF: Capture/Compare 2 overcapture flag
  *            @arg TMR_FLAG_CC3OF: Capture/Compare 3 overcapture flag
  *            @arg TMR_FLAG_CC4OF: Capture/Compare 4 overcapture flag
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#define __DAL_TMR_CLEAR_FLAG(__HANDLE__, __FLAG__)        ((__HANDLE__)->Instance->STS = ~(__FLAG__))

/**
  * @brief  Check whether the specified TMR interrupt source is enabled or not.
  * @param  __HANDLE__ TMR handle
  * @param  __INTERRUPT__ specifies the TMR interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg TMR_IT_UPDATE: Update interrupt
  *            @arg TMR_IT_CC1:   Capture/Compare 1 interrupt
  *            @arg TMR_IT_CC2:  Capture/Compare 2 interrupt
  *            @arg TMR_IT_CC3:  Capture/Compare 3 interrupt
  *            @arg TMR_IT_CC4:  Capture/Compare 4 interrupt
  *            @arg TMR_IT_COM:   Commutation interrupt
  *            @arg TMR_IT_TRIGGER: Trigger interrupt
  *            @arg TMR_IT_BREAK: Break interrupt
  * @retval The state of TMR_IT (SET or RESET).
  */
#define __DAL_TMR_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) ((((__HANDLE__)->Instance->DIEN & (__INTERRUPT__)) \
                                                             == (__INTERRUPT__)) ? SET : RESET)

/** @brief Clear the TMR interrupt pending bits.
  * @param  __HANDLE__ TMR handle
  * @param  __INTERRUPT__ specifies the interrupt pending bit to clear.
  *          This parameter can be one of the following values:
  *            @arg TMR_IT_UPDATE: Update interrupt
  *            @arg TMR_IT_CC1:   Capture/Compare 1 interrupt
  *            @arg TMR_IT_CC2:  Capture/Compare 2 interrupt
  *            @arg TMR_IT_CC3:  Capture/Compare 3 interrupt
  *            @arg TMR_IT_CC4:  Capture/Compare 4 interrupt
  *            @arg TMR_IT_COM:   Commutation interrupt
  *            @arg TMR_IT_TRIGGER: Trigger interrupt
  *            @arg TMR_IT_BREAK: Break interrupt
  * @retval None
  */
#define __DAL_TMR_CLEAR_IT(__HANDLE__, __INTERRUPT__)      ((__HANDLE__)->Instance->STS = ~(__INTERRUPT__))

/**
  * @brief  Indicates whether or not the TMR Counter is used as downcounter.
  * @param  __HANDLE__ TMR handle.
  * @retval False (Counter used as upcounter) or True (Counter used as downcounter)
  * @note This macro is particularly useful to get the counting mode when the timer operates in Center-aligned mode
  *       or Encoder mode.
  */
#define __DAL_TMR_IS_TMR_COUNTING_DOWN(__HANDLE__)    (((__HANDLE__)->Instance->CTRL1 &(TMR_CTRL1_CNTDIR)) == (TMR_CTRL1_CNTDIR))

/**
  * @brief  Set the TMR Prescaler on runtime.
  * @param  __HANDLE__ TMR handle.
  * @param  __PRESC__ specifies the Prescaler new value.
  * @retval None
  */
#define __DAL_TMR_SET_PRESCALER(__HANDLE__, __PRESC__)       ((__HANDLE__)->Instance->PSC = (__PRESC__))

/**
  * @brief  Set the TMR Counter Register value on runtime.
  * @param  __HANDLE__ TMR handle.
  * @param  __COUNTER__ specifies the Counter register new value.
  * @retval None
  */
#define __DAL_TMR_SET_COUNTER(__HANDLE__, __COUNTER__)  ((__HANDLE__)->Instance->CNT = (__COUNTER__))

/**
  * @brief  Get the TMR Counter Register value on runtime.
  * @param  __HANDLE__ TMR handle.
  * @retval 16-bit or 32-bit value of the timer counter register (TMRx_CNT)
  */
#define __DAL_TMR_GET_COUNTER(__HANDLE__)  ((__HANDLE__)->Instance->CNT)

/**
  * @brief  Set the TMR Autoreload Register value on runtime without calling another time any Init function.
  * @param  __HANDLE__ TMR handle.
  * @param  __AUTORELOAD__ specifies the Counter register new value.
  * @retval None
  */
#define __DAL_TMR_SET_AUTORELOAD(__HANDLE__, __AUTORELOAD__) \
  do{                                                    \
    (__HANDLE__)->Instance->AUTORLD = (__AUTORELOAD__);  \
    (__HANDLE__)->Init.Period = (__AUTORELOAD__);    \
  } while(0)

/**
  * @brief  Get the TMR Autoreload Register value on runtime.
  * @param  __HANDLE__ TMR handle.
  * @retval 16-bit or 32-bit value of the timer auto-reload register(TMRx_AUTORLD)
  */
#define __DAL_TMR_GET_AUTORELOAD(__HANDLE__)  ((__HANDLE__)->Instance->AUTORLD)

/**
  * @brief  Set the TMR Clock Division value on runtime without calling another time any Init function.
  * @param  __HANDLE__ TMR handle.
  * @param  __CKD__ specifies the clock division value.
  *          This parameter can be one of the following value:
  *            @arg TMR_CLOCKDIVISION_DIV1: tDTS=tCK_INT
  *            @arg TMR_CLOCKDIVISION_DIV2: tDTS=2*tCK_INT
  *            @arg TMR_CLOCKDIVISION_DIV4: tDTS=4*tCK_INT
  * @retval None
  */
#define __DAL_TMR_SET_CLOCKDIVISION(__HANDLE__, __CKD__) \
  do{                                                   \
    (__HANDLE__)->Instance->CTRL1 &= (~TMR_CTRL1_CLKDIV);  \
    (__HANDLE__)->Instance->CTRL1 |= (__CKD__);       \
    (__HANDLE__)->Init.ClockDivision = (__CKD__);   \
  } while(0)

/**
  * @brief  Get the TMR Clock Division value on runtime.
  * @param  __HANDLE__ TMR handle.
  * @retval The clock division can be one of the following values:
  *            @arg TMR_CLOCKDIVISION_DIV1: tDTS=tCK_INT
  *            @arg TMR_CLOCKDIVISION_DIV2: tDTS=2*tCK_INT
  *            @arg TMR_CLOCKDIVISION_DIV4: tDTS=4*tCK_INT
  */
#define __DAL_TMR_GET_CLOCKDIVISION(__HANDLE__)  ((__HANDLE__)->Instance->CTRL1 & TMR_CTRL1_CLKDIV)

/**
  * @brief  Set the TMR Input Capture prescaler on runtime without calling another time DAL_TMR_IC_ConfigChannel()
  *         function.
  * @param  __HANDLE__ TMR handle.
  * @param  __CHANNEL__ TMR Channels to be configured.
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @param  __ICPSC__ specifies the Input Capture4 prescaler new value.
  *          This parameter can be one of the following values:
  *            @arg TMR_ICPSC_DIV1: no prescaler
  *            @arg TMR_ICPSC_DIV2: capture is done once every 2 events
  *            @arg TMR_ICPSC_DIV4: capture is done once every 4 events
  *            @arg TMR_ICPSC_DIV8: capture is done once every 8 events
  * @retval None
  */
#define __DAL_TMR_SET_ICPRESCALER(__HANDLE__, __CHANNEL__, __ICPSC__) \
  do{                                                    \
    TMR_RESET_ICPRESCALERVALUE((__HANDLE__), (__CHANNEL__));  \
    TMR_SET_ICPRESCALERVALUE((__HANDLE__), (__CHANNEL__), (__ICPSC__)); \
  } while(0)

/**
  * @brief  Get the TMR Input Capture prescaler on runtime.
  * @param  __HANDLE__ TMR handle.
  * @param  __CHANNEL__ TMR Channels to be configured.
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: get input capture 1 prescaler value
  *            @arg TMR_CHANNEL_2: get input capture 2 prescaler value
  *            @arg TMR_CHANNEL_3: get input capture 3 prescaler value
  *            @arg TMR_CHANNEL_4: get input capture 4 prescaler value
  * @retval The input capture prescaler can be one of the following values:
  *            @arg TMR_ICPSC_DIV1: no prescaler
  *            @arg TMR_ICPSC_DIV2: capture is done once every 2 events
  *            @arg TMR_ICPSC_DIV4: capture is done once every 4 events
  *            @arg TMR_ICPSC_DIV8: capture is done once every 8 events
  */
#define __DAL_TMR_GET_ICPRESCALER(__HANDLE__, __CHANNEL__)  \
  (((__CHANNEL__) == TMR_CHANNEL_1) ? ((__HANDLE__)->Instance->CCM1 & TMR_CCM1_IC1PSC) :\
   ((__CHANNEL__) == TMR_CHANNEL_2) ? (((__HANDLE__)->Instance->CCM1 & TMR_CCM1_IC2PSC) >> 8U) :\
   ((__CHANNEL__) == TMR_CHANNEL_3) ? ((__HANDLE__)->Instance->CCM2 & TMR_CCM2_IC3PSC) :\
   (((__HANDLE__)->Instance->CCM2 & TMR_CCM2_IC4PSC)) >> 8U)

/**
  * @brief  Set the TMR Capture Compare Register value on runtime without calling another time ConfigChannel function.
  * @param  __HANDLE__ TMR handle.
  * @param  __CHANNEL__ TMR Channels to be configured.
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @param  __COMPARE__ specifies the Capture Compare register new value.
  * @retval None
  */
#define __DAL_TMR_SET_COMPARE(__HANDLE__, __CHANNEL__, __COMPARE__) \
  (((__CHANNEL__) == TMR_CHANNEL_1) ? ((__HANDLE__)->Instance->CC1 = (__COMPARE__)) :\
   ((__CHANNEL__) == TMR_CHANNEL_2) ? ((__HANDLE__)->Instance->CC2 = (__COMPARE__)) :\
   ((__CHANNEL__) == TMR_CHANNEL_3) ? ((__HANDLE__)->Instance->CC3 = (__COMPARE__)) :\
   ((__HANDLE__)->Instance->CC4 = (__COMPARE__)))

/**
  * @brief  Get the TMR Capture Compare Register value on runtime.
  * @param  __HANDLE__ TMR handle.
  * @param  __CHANNEL__ TMR Channel associated with the capture compare register
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: get capture/compare 1 register value
  *            @arg TMR_CHANNEL_2: get capture/compare 2 register value
  *            @arg TMR_CHANNEL_3: get capture/compare 3 register value
  *            @arg TMR_CHANNEL_4: get capture/compare 4 register value
  * @retval 16-bit or 32-bit value of the capture/compare register (TMRx_CCRy)
  */
#define __DAL_TMR_GET_COMPARE(__HANDLE__, __CHANNEL__) \
  (((__CHANNEL__) == TMR_CHANNEL_1) ? ((__HANDLE__)->Instance->CC1) :\
   ((__CHANNEL__) == TMR_CHANNEL_2) ? ((__HANDLE__)->Instance->CC2) :\
   ((__CHANNEL__) == TMR_CHANNEL_3) ? ((__HANDLE__)->Instance->CC3) :\
   ((__HANDLE__)->Instance->CC4))

/**
  * @brief  Set the TMR Output compare preload.
  * @param  __HANDLE__ TMR handle.
  * @param  __CHANNEL__ TMR Channels to be configured.
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval None
  */
#define __DAL_TMR_ENABLE_OCxPRELOAD(__HANDLE__, __CHANNEL__)    \
  (((__CHANNEL__) == TMR_CHANNEL_1) ? ((__HANDLE__)->Instance->CCM1 |= TMR_CCM1_OC1PEN) :\
   ((__CHANNEL__) == TMR_CHANNEL_2) ? ((__HANDLE__)->Instance->CCM1 |= TMR_CCM1_OC2PEN) :\
   ((__CHANNEL__) == TMR_CHANNEL_3) ? ((__HANDLE__)->Instance->CCM2 |= TMR_CCM2_OC3PEN) :\
   ((__HANDLE__)->Instance->CCM2 |= TMR_CCM2_OC4PEN))

/**
  * @brief  Reset the TMR Output compare preload.
  * @param  __HANDLE__ TMR handle.
  * @param  __CHANNEL__ TMR Channels to be configured.
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @retval None
  */
#define __DAL_TMR_DISABLE_OCxPRELOAD(__HANDLE__, __CHANNEL__)    \
  (((__CHANNEL__) == TMR_CHANNEL_1) ? ((__HANDLE__)->Instance->CCM1 &= ~TMR_CCM1_OC1PEN) :\
   ((__CHANNEL__) == TMR_CHANNEL_2) ? ((__HANDLE__)->Instance->CCM1 &= ~TMR_CCM1_OC2PEN) :\
   ((__CHANNEL__) == TMR_CHANNEL_3) ? ((__HANDLE__)->Instance->CCM2 &= ~TMR_CCM2_OC3PEN) :\
   ((__HANDLE__)->Instance->CCM2 &= ~TMR_CCM2_OC4PEN))

/**
  * @brief  Enable fast mode for a given channel.
  * @param  __HANDLE__ TMR handle.
  * @param  __CHANNEL__ TMR Channels to be configured.
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @note  When fast mode is enabled an active edge on the trigger input acts
  *        like a compare match on CCx output. Delay to sample the trigger
  *        input and to activate CCx output is reduced to 3 clock cycles.
  * @note  Fast mode acts only if the channel is configured in PWM1 or PWM2 mode.
  * @retval None
  */
#define __DAL_TMR_ENABLE_OCxFAST(__HANDLE__, __CHANNEL__)    \
  (((__CHANNEL__) == TMR_CHANNEL_1) ? ((__HANDLE__)->Instance->CCM1 |= TMR_CCM1_OC1FEN) :\
   ((__CHANNEL__) == TMR_CHANNEL_2) ? ((__HANDLE__)->Instance->CCM1 |= TMR_CCM1_OC2FEN) :\
   ((__CHANNEL__) == TMR_CHANNEL_3) ? ((__HANDLE__)->Instance->CCM2 |= TMR_CCM2_OC3FEN) :\
   ((__HANDLE__)->Instance->CCM2 |= TMR_CCM2_OC4FEN))

/**
  * @brief  Disable fast mode for a given channel.
  * @param  __HANDLE__ TMR handle.
  * @param  __CHANNEL__ TMR Channels to be configured.
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @note  When fast mode is disabled CCx output behaves normally depending
  *        on counter and CCx values even when the trigger is ON. The minimum
  *        delay to activate CCx output when an active edge occurs on the
  *        trigger input is 5 clock cycles.
  * @retval None
  */
#define __DAL_TMR_DISABLE_OCxFAST(__HANDLE__, __CHANNEL__)    \
  (((__CHANNEL__) == TMR_CHANNEL_1) ? ((__HANDLE__)->Instance->CCM1 &= ~TMR_CCM1_OC1FEN) :\
   ((__CHANNEL__) == TMR_CHANNEL_2) ? ((__HANDLE__)->Instance->CCM1 &= ~TMR_CCM1_OC2FEN) :\
   ((__CHANNEL__) == TMR_CHANNEL_3) ? ((__HANDLE__)->Instance->CCM2 &= ~TMR_CCM2_OC3FEN) :\
   ((__HANDLE__)->Instance->CCM2 &= ~TMR_CCM2_OC4FEN))

/**
  * @brief  Set the Update Request Source (URS) bit of the TMRx_CTRL1 register.
  * @param  __HANDLE__ TMR handle.
  * @note  When the URS bit of the TMRx_CTRL1 register is set, only counter
  *        overflow/underflow generates an update interrupt or DMA request (if
  *        enabled)
  * @retval None
  */
#define __DAL_TMR_URS_ENABLE(__HANDLE__)  ((__HANDLE__)->Instance->CTRL1|= TMR_CTRL1_URSSEL)

/**
  * @brief  Reset the Update Request Source (URS) bit of the TMRx_CTRL1 register.
  * @param  __HANDLE__ TMR handle.
  * @note  When the URS bit of the TMRx_CTRL1 register is reset, any of the
  *        following events generate an update interrupt or DMA request (if
  *        enabled):
  *           _ Counter overflow underflow
  *           _ Setting the UG bit
  *           _ Update generation through the slave mode controller
  * @retval None
  */
#define __DAL_TMR_URS_DISABLE(__HANDLE__)  ((__HANDLE__)->Instance->CTRL1&=~TMR_CTRL1_URSSEL)

/**
  * @brief  Set the TMR Capture x input polarity on runtime.
  * @param  __HANDLE__ TMR handle.
  * @param  __CHANNEL__ TMR Channels to be configured.
  *          This parameter can be one of the following values:
  *            @arg TMR_CHANNEL_1: TMR Channel 1 selected
  *            @arg TMR_CHANNEL_2: TMR Channel 2 selected
  *            @arg TMR_CHANNEL_3: TMR Channel 3 selected
  *            @arg TMR_CHANNEL_4: TMR Channel 4 selected
  * @param  __POLARITY__ Polarity for TIx source
  *            @arg TMR_INPUTCHANNELPOLARITY_RISING: Rising Edge
  *            @arg TMR_INPUTCHANNELPOLARITY_FALLING: Falling Edge
  *            @arg TMR_INPUTCHANNELPOLARITY_BOTHEDGE: Rising and Falling Edge
  * @retval None
  */
#define __DAL_TMR_SET_CAPTUREPOLARITY(__HANDLE__, __CHANNEL__, __POLARITY__)    \
  do{                                                                     \
    TMR_RESET_CAPTUREPOLARITY((__HANDLE__), (__CHANNEL__));               \
    TMR_SET_CAPTUREPOLARITY((__HANDLE__), (__CHANNEL__), (__POLARITY__)); \
  }while(0)

/** @brief  Select the Capture/compare DMA request source.
  * @param  __HANDLE__ specifies the TMR Handle.
  * @param  __CCDMA__ specifies Capture/compare DMA request source
  *          This parameter can be one of the following values:
  *            @arg TMR_CCDMAREQUEST_CC: CCx DMA request generated on Capture/Compare event
  *            @arg TMR_CCDMAREQUEST_UPDATE: CCx DMA request generated on Update event
  * @retval None
  */
#define __DAL_TMR_SELECT_CCDMAREQUEST(__HANDLE__, __CCDMA__)    \
  MODIFY_REG((__HANDLE__)->Instance->CTRL2, TMR_CTRL2_CCDSEL, (__CCDMA__))

/**
  * @}
  */
/* End of exported macros ----------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/
/** @defgroup TMR_Private_Constants TMR Private Constants
  * @{
  */
/* The counter of a timer instance is disabled only if all the CCx and CCxN
   channels have been disabled */
#define TMR_CCEN_CCxE_MASK  ((uint32_t)(TMR_CCEN_CC1EN | TMR_CCEN_CC2EN | TMR_CCEN_CC3EN | TMR_CCEN_CC4EN))
#define TMR_CCEN_CCxNE_MASK ((uint32_t)(TMR_CCEN_CC1NEN | TMR_CCEN_CC2NEN | TMR_CCEN_CC3NEN))
/**
  * @}
  */
/* End of private constants --------------------------------------------------*/

