betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_tmr.h
/* Private macros ------------------------------------------------------------*/
/** @defgroup TMR_Private_Macros TMR Private Macros
  * @{
  */
#define IS_TMR_CLEARINPUT_SOURCE(__MODE__)  (((__MODE__) == TMR_CLEARINPUTSOURCE_NONE)      || \
                                             ((__MODE__) == TMR_CLEARINPUTSOURCE_ETR))

#define IS_TMR_DMA_BASE(__BASE__) (((__BASE__) == TMR_DMABASE_CTRL1)    || \
                                   ((__BASE__) == TMR_DMABASE_CTRL2)    || \
                                   ((__BASE__) == TMR_DMABASE_SMCTRL)   || \
                                   ((__BASE__) == TMR_DMABASE_DIEN)     || \
                                   ((__BASE__) == TMR_DMABASE_STS)      || \
                                   ((__BASE__) == TMR_DMABASE_CEG)      || \
                                   ((__BASE__) == TMR_DMABASE_CCM1)     || \
                                   ((__BASE__) == TMR_DMABASE_CCM2)     || \
                                   ((__BASE__) == TMR_DMABASE_CCEN)     || \
                                   ((__BASE__) == TMR_DMABASE_CNT)      || \
                                   ((__BASE__) == TMR_DMABASE_PSC)      || \
                                   ((__BASE__) == TMR_DMABASE_AUTORLD)  || \
                                   ((__BASE__) == TMR_DMABASE_REPCNT)   || \
                                   ((__BASE__) == TMR_DMABASE_CC1)      || \
                                   ((__BASE__) == TMR_DMABASE_CC2)      || \
                                   ((__BASE__) == TMR_DMABASE_CC3)      || \
                                   ((__BASE__) == TMR_DMABASE_CC4)      || \
                                   ((__BASE__) == TMR_DMABASE_BDT))

#define IS_TMR_EVENT_SOURCE(__SOURCE__) ((((__SOURCE__) & 0xFFFFFF00U) == 0x00000000U) && ((__SOURCE__) != 0x00000000U))

#define IS_TMR_COUNTER_MODE(__MODE__)      (((__MODE__) == TMR_COUNTERMODE_UP)              || \
                                            ((__MODE__) == TMR_COUNTERMODE_DOWN)            || \
                                            ((__MODE__) == TMR_COUNTERMODE_CENTERALIGNED1)  || \
                                            ((__MODE__) == TMR_COUNTERMODE_CENTERALIGNED2)  || \
                                            ((__MODE__) == TMR_COUNTERMODE_CENTERALIGNED3))

#define IS_TMR_CLOCKDIVISION_DIV(__DIV__)  (((__DIV__) == TMR_CLOCKDIVISION_DIV1) || \
                                            ((__DIV__) == TMR_CLOCKDIVISION_DIV2) || \
                                            ((__DIV__) == TMR_CLOCKDIVISION_DIV4))

#define IS_TMR_AUTORELOAD_PRELOAD(PRELOAD) (((PRELOAD) == TMR_AUTORELOAD_PRELOAD_DISABLE) || \
                                            ((PRELOAD) == TMR_AUTORELOAD_PRELOAD_ENABLE))

#define IS_TMR_FAST_STATE(__STATE__)       (((__STATE__) == TMR_OCFAST_DISABLE) || \
                                            ((__STATE__) == TMR_OCFAST_ENABLE))

#define IS_TMR_OC_POLARITY(__POLARITY__)   (((__POLARITY__) == TMR_OCPOLARITY_HIGH) || \
                                            ((__POLARITY__) == TMR_OCPOLARITY_LOW))

#define IS_TMR_OCN_POLARITY(__POLARITY__)  (((__POLARITY__) == TMR_OCNPOLARITY_HIGH) || \
                                            ((__POLARITY__) == TMR_OCNPOLARITY_LOW))

#define IS_TMR_OCIDLE_STATE(__STATE__)     (((__STATE__) == TMR_OCIDLESTATE_SET) || \
                                            ((__STATE__) == TMR_OCIDLESTATE_RESET))

#define IS_TMR_OCNIDLE_STATE(__STATE__)    (((__STATE__) == TMR_OCNIDLESTATE_SET) || \
                                            ((__STATE__) == TMR_OCNIDLESTATE_RESET))

#define IS_TMR_ENCODERINPUT_POLARITY(__POLARITY__)   (((__POLARITY__) == TMR_ENCODERINPUTPOLARITY_RISING)   || \
                                                      ((__POLARITY__) == TMR_ENCODERINPUTPOLARITY_FALLING))

#define IS_TMR_IC_POLARITY(__POLARITY__)   (((__POLARITY__) == TMR_ICPOLARITY_RISING)   || \
                                            ((__POLARITY__) == TMR_ICPOLARITY_FALLING)  || \
                                            ((__POLARITY__) == TMR_ICPOLARITY_BOTHEDGE))

#define IS_TMR_IC_SELECTION(__SELECTION__) (((__SELECTION__) == TMR_ICSELECTION_DIRECTTI) || \
                                            ((__SELECTION__) == TMR_ICSELECTION_INDIRECTTI) || \
                                            ((__SELECTION__) == TMR_ICSELECTION_TRC))

#define IS_TMR_IC_PRESCALER(__PRESCALER__) (((__PRESCALER__) == TMR_ICPSC_DIV1) || \
                                            ((__PRESCALER__) == TMR_ICPSC_DIV2) || \
                                            ((__PRESCALER__) == TMR_ICPSC_DIV4) || \
                                            ((__PRESCALER__) == TMR_ICPSC_DIV8))

#define IS_TMR_OPM_MODE(__MODE__)          (((__MODE__) == TMR_OPMODE_SINGLE) || \
                                            ((__MODE__) == TMR_OPMODE_REPETITIVE))

#define IS_TMR_ENCODER_MODE(__MODE__)      (((__MODE__) == TMR_ENCODERMODE_TI1) || \
                                            ((__MODE__) == TMR_ENCODERMODE_TI2) || \
                                            ((__MODE__) == TMR_ENCODERMODE_TI12))

#define IS_TMR_DMA_SOURCE(__SOURCE__) ((((__SOURCE__) & 0xFFFF80FFU) == 0x00000000U) && ((__SOURCE__) != 0x00000000U))

#define IS_TMR_CHANNELS(__CHANNEL__)       (((__CHANNEL__) == TMR_CHANNEL_1) || \
                                            ((__CHANNEL__) == TMR_CHANNEL_2) || \
                                            ((__CHANNEL__) == TMR_CHANNEL_3) || \
                                            ((__CHANNEL__) == TMR_CHANNEL_4) || \
                                            ((__CHANNEL__) == TMR_CHANNEL_ALL))

#define IS_TMR_OPM_CHANNELS(__CHANNEL__)   (((__CHANNEL__) == TMR_CHANNEL_1) || \
                                            ((__CHANNEL__) == TMR_CHANNEL_2))

#define IS_TMR_PERIOD(__HANDLE__, __PERIOD__) ((IS_TMR_32B_COUNTER_INSTANCE(((__HANDLE__)->Instance)) == 0U) ? \
                                               (((__PERIOD__) > 0U) && ((__PERIOD__) <= 0x0000FFFFU)) :        \
                                               ((__PERIOD__) > 0U))

#define IS_TMR_COMPLEMENTARY_CHANNELS(__CHANNEL__) (((__CHANNEL__) == TMR_CHANNEL_1) || \
                                                    ((__CHANNEL__) == TMR_CHANNEL_2) || \
                                                    ((__CHANNEL__) == TMR_CHANNEL_3))

#define IS_TMR_CLOCKSOURCE(__CLOCK__) (((__CLOCK__) == TMR_CLOCKSOURCE_INTERNAL) || \
                                       ((__CLOCK__) == TMR_CLOCKSOURCE_ETRMODE1) || \
                                       ((__CLOCK__) == TMR_CLOCKSOURCE_ETRMODE2) || \
                                       ((__CLOCK__) == TMR_CLOCKSOURCE_TI1ED)    || \
                                       ((__CLOCK__) == TMR_CLOCKSOURCE_TI1)      || \
                                       ((__CLOCK__) == TMR_CLOCKSOURCE_TI2)      || \
                                       ((__CLOCK__) == TMR_CLOCKSOURCE_ITR0)     || \
                                       ((__CLOCK__) == TMR_CLOCKSOURCE_ITR1)     || \
                                       ((__CLOCK__) == TMR_CLOCKSOURCE_ITR2)     || \
                                       ((__CLOCK__) == TMR_CLOCKSOURCE_ITR3))

#define IS_TMR_CLOCKPOLARITY(__POLARITY__) (((__POLARITY__) == TMR_CLOCKPOLARITY_INVERTED)    || \
                                            ((__POLARITY__) == TMR_CLOCKPOLARITY_NONINVERTED) || \
                                            ((__POLARITY__) == TMR_CLOCKPOLARITY_RISING)      || \
                                            ((__POLARITY__) == TMR_CLOCKPOLARITY_FALLING)     || \
                                            ((__POLARITY__) == TMR_CLOCKPOLARITY_BOTHEDGE))

#define IS_TMR_CLOCKPRESCALER(__PRESCALER__) (((__PRESCALER__) == TMR_CLOCKPRESCALER_DIV1) || \
                                              ((__PRESCALER__) == TMR_CLOCKPRESCALER_DIV2) || \
                                              ((__PRESCALER__) == TMR_CLOCKPRESCALER_DIV4) || \
                                              ((__PRESCALER__) == TMR_CLOCKPRESCALER_DIV8))

#define IS_TMR_CLOCKFILTER(__ICFILTER__)      ((__ICFILTER__) <= 0xFU)

#define IS_TMR_CLEARINPUT_POLARITY(__POLARITY__) (((__POLARITY__) == TMR_CLEARINPUTPOLARITY_INVERTED) || \
                                                  ((__POLARITY__) == TMR_CLEARINPUTPOLARITY_NONINVERTED))

#define IS_TMR_CLEARINPUT_PRESCALER(__PRESCALER__) (((__PRESCALER__) == TMR_CLEARINPUTPRESCALER_DIV1) || \
                                                    ((__PRESCALER__) == TMR_CLEARINPUTPRESCALER_DIV2) || \
                                                    ((__PRESCALER__) == TMR_CLEARINPUTPRESCALER_DIV4) || \
                                                    ((__PRESCALER__) == TMR_CLEARINPUTPRESCALER_DIV8))

#define IS_TMR_CLEARINPUT_FILTER(__ICFILTER__) ((__ICFILTER__) <= 0xFU)

#define IS_TMR_OSSR_STATE(__STATE__)       (((__STATE__) == TMR_OSSR_ENABLE) || \
                                            ((__STATE__) == TMR_OSSR_DISABLE))

#define IS_TMR_OSSI_STATE(__STATE__)       (((__STATE__) == TMR_OSSI_ENABLE) || \
                                            ((__STATE__) == TMR_OSSI_DISABLE))

#define IS_TMR_LOCK_LEVEL(__LEVEL__)       (((__LEVEL__) == TMR_LOCKLEVEL_OFF) || \
                                            ((__LEVEL__) == TMR_LOCKLEVEL_1)   || \
                                            ((__LEVEL__) == TMR_LOCKLEVEL_2)   || \
                                            ((__LEVEL__) == TMR_LOCKLEVEL_3))

#define IS_TMR_BREAK_FILTER(__BRKFILTER__) ((__BRKFILTER__) <= 0xFUL)


#define IS_TMR_BREAK_STATE(__STATE__)      (((__STATE__) == TMR_BREAK_ENABLE) || \
                                            ((__STATE__) == TMR_BREAK_DISABLE))

#define IS_TMR_BREAK_POLARITY(__POLARITY__) (((__POLARITY__) == TMR_BREAKPOLARITY_LOW) || \
                                             ((__POLARITY__) == TMR_BREAKPOLARITY_HIGH))

