betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_tmr.h
#define IS_TMR_AUTOMATIC_OUTPUT_STATE(__STATE__) (((__STATE__) == TMR_AUTOMATICOUTPUT_ENABLE) || \
                                                  ((__STATE__) == TMR_AUTOMATICOUTPUT_DISABLE))

#define IS_TMR_TRGO_SOURCE(__SOURCE__) (((__SOURCE__) == TMR_TRGO_RESET)  || \
                                        ((__SOURCE__) == TMR_TRGO_ENABLE) || \
                                        ((__SOURCE__) == TMR_TRGO_UPDATE) || \
                                        ((__SOURCE__) == TMR_TRGO_OC1)    || \
                                        ((__SOURCE__) == TMR_TRGO_OC1REF) || \
                                        ((__SOURCE__) == TMR_TRGO_OC2REF) || \
                                        ((__SOURCE__) == TMR_TRGO_OC3REF) || \
                                        ((__SOURCE__) == TMR_TRGO_OC4REF))

#define IS_TMR_MSM_STATE(__STATE__)      (((__STATE__) == TMR_MASTERSLAVEMODE_ENABLE) || \
                                          ((__STATE__) == TMR_MASTERSLAVEMODE_DISABLE))

#define IS_TMR_SLAVE_MODE(__MODE__) (((__MODE__) == TMR_SLAVEMODE_DISABLE)   || \
                                     ((__MODE__) == TMR_SLAVEMODE_RESET)     || \
                                     ((__MODE__) == TMR_SLAVEMODE_GATED)     || \
                                     ((__MODE__) == TMR_SLAVEMODE_TRIGGER)   || \
                                     ((__MODE__) == TMR_SLAVEMODE_EXTERNAL1))

#define IS_TMR_PWM_MODE(__MODE__) (((__MODE__) == TMR_OCMODE_PWM1)               || \
                                   ((__MODE__) == TMR_OCMODE_PWM2))

#define IS_TMR_OC_MODE(__MODE__)  (((__MODE__) == TMR_OCMODE_TIMING)             || \
                                   ((__MODE__) == TMR_OCMODE_ACTIVE)             || \
                                   ((__MODE__) == TMR_OCMODE_INACTIVE)           || \
                                   ((__MODE__) == TMR_OCMODE_TOGGLE)             || \
                                   ((__MODE__) == TMR_OCMODE_FORCED_ACTIVE)      || \
                                   ((__MODE__) == TMR_OCMODE_FORCED_INACTIVE))

#define IS_TMR_TRIGGER_SELECTION(__SELECTION__) (((__SELECTION__) == TMR_TS_ITR0)    || \
                                                 ((__SELECTION__) == TMR_TS_ITR1)    || \
                                                 ((__SELECTION__) == TMR_TS_ITR2)    || \
                                                 ((__SELECTION__) == TMR_TS_ITR3)    || \
                                                 ((__SELECTION__) == TMR_TS_TI1F_ED) || \
                                                 ((__SELECTION__) == TMR_TS_TI1FP1)  || \
                                                 ((__SELECTION__) == TMR_TS_TI2FP2)  || \
                                                 ((__SELECTION__) == TMR_TS_ETRF))

#define IS_TMR_INTERNAL_TRIGGEREVENT_SELECTION(__SELECTION__) (((__SELECTION__) == TMR_TS_ITR0) || \
                                                               ((__SELECTION__) == TMR_TS_ITR1) || \
                                                               ((__SELECTION__) == TMR_TS_ITR2) || \
                                                               ((__SELECTION__) == TMR_TS_ITR3) || \
                                                               ((__SELECTION__) == TMR_TS_NONE))

#define IS_TMR_TRIGGERPOLARITY(__POLARITY__)   (((__POLARITY__) == TMR_TRIGGERPOLARITY_INVERTED   ) || \
                                                ((__POLARITY__) == TMR_TRIGGERPOLARITY_NONINVERTED) || \
                                                ((__POLARITY__) == TMR_TRIGGERPOLARITY_RISING     ) || \
                                                ((__POLARITY__) == TMR_TRIGGERPOLARITY_FALLING    ) || \
                                                ((__POLARITY__) == TMR_TRIGGERPOLARITY_BOTHEDGE   ))

#define IS_TMR_TRIGGERPRESCALER(__PRESCALER__) (((__PRESCALER__) == TMR_TRIGGERPRESCALER_DIV1) || \
                                                ((__PRESCALER__) == TMR_TRIGGERPRESCALER_DIV2) || \
                                                ((__PRESCALER__) == TMR_TRIGGERPRESCALER_DIV4) || \
                                                ((__PRESCALER__) == TMR_TRIGGERPRESCALER_DIV8))

#define IS_TMR_TRIGGERFILTER(__ICFILTER__) ((__ICFILTER__) <= 0xFU)

#define IS_TMR_TI1SELECTION(__TI1SELECTION__)  (((__TI1SELECTION__) == TMR_TI1SELECTION_CH1) || \
                                                ((__TI1SELECTION__) == TMR_TI1SELECTION_XORCOMBINATION))

#define IS_TMR_DMA_LENGTH(__LENGTH__)      (((__LENGTH__) == TMR_DMABURSTLENGTH_1TRANSFER)   || \
                                            ((__LENGTH__) == TMR_DMABURSTLENGTH_2TRANSFERS)  || \
                                            ((__LENGTH__) == TMR_DMABURSTLENGTH_3TRANSFERS)  || \
                                            ((__LENGTH__) == TMR_DMABURSTLENGTH_4TRANSFERS)  || \
                                            ((__LENGTH__) == TMR_DMABURSTLENGTH_5TRANSFERS)  || \
                                            ((__LENGTH__) == TMR_DMABURSTLENGTH_6TRANSFERS)  || \
                                            ((__LENGTH__) == TMR_DMABURSTLENGTH_7TRANSFERS)  || \
                                            ((__LENGTH__) == TMR_DMABURSTLENGTH_8TRANSFERS)  || \
                                            ((__LENGTH__) == TMR_DMABURSTLENGTH_9TRANSFERS)  || \
                                            ((__LENGTH__) == TMR_DMABURSTLENGTH_10TRANSFERS) || \
                                            ((__LENGTH__) == TMR_DMABURSTLENGTH_11TRANSFERS) || \
                                            ((__LENGTH__) == TMR_DMABURSTLENGTH_12TRANSFERS) || \
                                            ((__LENGTH__) == TMR_DMABURSTLENGTH_13TRANSFERS) || \
                                            ((__LENGTH__) == TMR_DMABURSTLENGTH_14TRANSFERS) || \
                                            ((__LENGTH__) == TMR_DMABURSTLENGTH_15TRANSFERS) || \
                                            ((__LENGTH__) == TMR_DMABURSTLENGTH_16TRANSFERS) || \
                                            ((__LENGTH__) == TMR_DMABURSTLENGTH_17TRANSFERS) || \
                                            ((__LENGTH__) == TMR_DMABURSTLENGTH_18TRANSFERS))

#define IS_TMR_DMA_DATA_LENGTH(LENGTH) (((LENGTH) >= 0x1U) && ((LENGTH) < 0x10000U))

#define IS_TMR_IC_FILTER(__ICFILTER__)   ((__ICFILTER__) <= 0xFU)

#define IS_TMR_DEADTIME(__DEADTIME__)    ((__DEADTIME__) <= 0xFFU)

