betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_tmr.h
#define IS_TMR_SLAVEMODE_TRIGGER_ENABLED(__TRIGGER__) ((__TRIGGER__) == TMR_SLAVEMODE_TRIGGER)

#define TMR_SET_ICPRESCALERVALUE(__HANDLE__, __CHANNEL__, __ICPSC__) \
  (((__CHANNEL__) == TMR_CHANNEL_1) ? ((__HANDLE__)->Instance->CCM1 |= (__ICPSC__)) :\
   ((__CHANNEL__) == TMR_CHANNEL_2) ? ((__HANDLE__)->Instance->CCM1 |= ((__ICPSC__) << 8U)) :\
   ((__CHANNEL__) == TMR_CHANNEL_3) ? ((__HANDLE__)->Instance->CCM2 |= (__ICPSC__)) :\
   ((__HANDLE__)->Instance->CCM2 |= ((__ICPSC__) << 8U)))

#define TMR_RESET_ICPRESCALERVALUE(__HANDLE__, __CHANNEL__) \
  (((__CHANNEL__) == TMR_CHANNEL_1) ? ((__HANDLE__)->Instance->CCM1 &= ~TMR_CCM1_IC1PSC) :\
   ((__CHANNEL__) == TMR_CHANNEL_2) ? ((__HANDLE__)->Instance->CCM1 &= ~TMR_CCM1_IC2PSC) :\
   ((__CHANNEL__) == TMR_CHANNEL_3) ? ((__HANDLE__)->Instance->CCM2 &= ~TMR_CCM2_IC3PSC) :\
   ((__HANDLE__)->Instance->CCM2 &= ~TMR_CCM2_IC4PSC))

#define TMR_SET_CAPTUREPOLARITY(__HANDLE__, __CHANNEL__, __POLARITY__) \
  (((__CHANNEL__) == TMR_CHANNEL_1) ? ((__HANDLE__)->Instance->CCEN |= (__POLARITY__)) :\
   ((__CHANNEL__) == TMR_CHANNEL_2) ? ((__HANDLE__)->Instance->CCEN |= ((__POLARITY__) << 4U)) :\
   ((__CHANNEL__) == TMR_CHANNEL_3) ? ((__HANDLE__)->Instance->CCEN |= ((__POLARITY__) << 8U)) :\
   ((__HANDLE__)->Instance->CCEN |= (((__POLARITY__) << 12U))))

#define TMR_RESET_CAPTUREPOLARITY(__HANDLE__, __CHANNEL__) \
  (((__CHANNEL__) == TMR_CHANNEL_1) ? ((__HANDLE__)->Instance->CCEN &= ~(TMR_CCEN_CC1POL | TMR_CCEN_CC1NPOL)) :\
   ((__CHANNEL__) == TMR_CHANNEL_2) ? ((__HANDLE__)->Instance->CCEN &= ~(TMR_CCEN_CC2POL | TMR_CCEN_CC2NPOL)) :\
   ((__CHANNEL__) == TMR_CHANNEL_3) ? ((__HANDLE__)->Instance->CCEN &= ~(TMR_CCEN_CC3POL | TMR_CCEN_CC3NPOL)) :\
   ((__HANDLE__)->Instance->CCEN &= ~(TMR_CCEN_CC4POL | TMR_CCEN_CC4NPOL)))

#define TMR_CHANNEL_STATE_GET(__HANDLE__, __CHANNEL__)\
  (((__CHANNEL__) == TMR_CHANNEL_1) ? (__HANDLE__)->ChannelState[0] :\
   ((__CHANNEL__) == TMR_CHANNEL_2) ? (__HANDLE__)->ChannelState[1] :\
   ((__CHANNEL__) == TMR_CHANNEL_3) ? (__HANDLE__)->ChannelState[2] :\
   (__HANDLE__)->ChannelState[3])

#define TMR_CHANNEL_STATE_SET(__HANDLE__, __CHANNEL__, __CHANNEL_STATE__) \
  (((__CHANNEL__) == TMR_CHANNEL_1) ? ((__HANDLE__)->ChannelState[0] = (__CHANNEL_STATE__)) :\
   ((__CHANNEL__) == TMR_CHANNEL_2) ? ((__HANDLE__)->ChannelState[1] = (__CHANNEL_STATE__)) :\
   ((__CHANNEL__) == TMR_CHANNEL_3) ? ((__HANDLE__)->ChannelState[2] = (__CHANNEL_STATE__)) :\
   ((__HANDLE__)->ChannelState[3] = (__CHANNEL_STATE__)))

#define TMR_CHANNEL_STATE_SET_ALL(__HANDLE__,  __CHANNEL_STATE__) do { \
                                                                       (__HANDLE__)->ChannelState[0]  = (__CHANNEL_STATE__);  \
                                                                       (__HANDLE__)->ChannelState[1]  = (__CHANNEL_STATE__);  \
                                                                       (__HANDLE__)->ChannelState[2]  = (__CHANNEL_STATE__);  \
                                                                       (__HANDLE__)->ChannelState[3]  = (__CHANNEL_STATE__);  \
                                                                     } while(0)

#define TMR_CHANNEL_N_STATE_GET(__HANDLE__, __CHANNEL__)\
  (((__CHANNEL__) == TMR_CHANNEL_1) ? (__HANDLE__)->ChannelNState[0] :\
   ((__CHANNEL__) == TMR_CHANNEL_2) ? (__HANDLE__)->ChannelNState[1] :\
   ((__CHANNEL__) == TMR_CHANNEL_3) ? (__HANDLE__)->ChannelNState[2] :\
   (__HANDLE__)->ChannelNState[3])

#define TMR_CHANNEL_N_STATE_SET(__HANDLE__, __CHANNEL__, __CHANNEL_STATE__) \
  (((__CHANNEL__) == TMR_CHANNEL_1) ? ((__HANDLE__)->ChannelNState[0] = (__CHANNEL_STATE__)) :\
   ((__CHANNEL__) == TMR_CHANNEL_2) ? ((__HANDLE__)->ChannelNState[1] = (__CHANNEL_STATE__)) :\
   ((__CHANNEL__) == TMR_CHANNEL_3) ? ((__HANDLE__)->ChannelNState[2] = (__CHANNEL_STATE__)) :\
   ((__HANDLE__)->ChannelNState[3] = (__CHANNEL_STATE__)))

#define TMR_CHANNEL_N_STATE_SET_ALL(__HANDLE__,  __CHANNEL_STATE__) do { \
                                                                         (__HANDLE__)->ChannelNState[0] = \
                                                                         (__CHANNEL_STATE__);  \
                                                                         (__HANDLE__)->ChannelNState[1] = \
                                                                         (__CHANNEL_STATE__);  \
                                                                         (__HANDLE__)->ChannelNState[2] = \
                                                                         (__CHANNEL_STATE__);  \
                                                                         (__HANDLE__)->ChannelNState[3] = \
                                                                         (__CHANNEL_STATE__);  \
                                                                       } while(0)

/**
  * @}
  */
/* End of private macros -----------------------------------------------------*/

/* Include TMR DAL Extended module */
#include "apm32f4xx_dal_tmr_ex.h"

/* Exported functions --------------------------------------------------------*/
/** @addtogroup TMR_Exported_Functions TMR Exported Functions
  * @{
  */

/** @addtogroup TMR_Exported_Functions_Group1 TMR Time Base functions
  *  @brief   Time Base functions
  * @{
  */
/* Time Base functions ********************************************************/
DAL_StatusTypeDef DAL_TMR_Base_Init(TMR_HandleTypeDef *htmr);
DAL_StatusTypeDef DAL_TMR_Base_DeInit(TMR_HandleTypeDef *htmr);
void DAL_TMR_Base_MspInit(TMR_HandleTypeDef *htmr);
void DAL_TMR_Base_MspDeInit(TMR_HandleTypeDef *htmr);
/* Blocking mode: Polling */
DAL_StatusTypeDef DAL_TMR_Base_Start(TMR_HandleTypeDef *htmr);
DAL_StatusTypeDef DAL_TMR_Base_Stop(TMR_HandleTypeDef *htmr);
/* Non-Blocking mode: Interrupt */
DAL_StatusTypeDef DAL_TMR_Base_Start_IT(TMR_HandleTypeDef *htmr);
DAL_StatusTypeDef DAL_TMR_Base_Stop_IT(TMR_HandleTypeDef *htmr);
/* Non-Blocking mode: DMA */
DAL_StatusTypeDef DAL_TMR_Base_Start_DMA(TMR_HandleTypeDef *htmr, uint32_t *pData, uint16_t Length);
DAL_StatusTypeDef DAL_TMR_Base_Stop_DMA(TMR_HandleTypeDef *htmr);
/**
  * @}
  */

/** @addtogroup TMR_Exported_Functions_Group2 TMR Output Compare functions
  *  @brief   TMR Output Compare functions
  * @{
  */
/* Timer Output Compare functions *********************************************/
DAL_StatusTypeDef DAL_TMR_OC_Init(TMR_HandleTypeDef *htmr);
DAL_StatusTypeDef DAL_TMR_OC_DeInit(TMR_HandleTypeDef *htmr);
void DAL_TMR_OC_MspInit(TMR_HandleTypeDef *htmr);
void DAL_TMR_OC_MspDeInit(TMR_HandleTypeDef *htmr);
/* Blocking mode: Polling */
DAL_StatusTypeDef DAL_TMR_OC_Start(TMR_HandleTypeDef *htmr, uint32_t Channel);
DAL_StatusTypeDef DAL_TMR_OC_Stop(TMR_HandleTypeDef *htmr, uint32_t Channel);
/* Non-Blocking mode: Interrupt */
DAL_StatusTypeDef DAL_TMR_OC_Start_IT(TMR_HandleTypeDef *htmr, uint32_t Channel);
DAL_StatusTypeDef DAL_TMR_OC_Stop_IT(TMR_HandleTypeDef *htmr, uint32_t Channel);
/* Non-Blocking mode: DMA */
DAL_StatusTypeDef DAL_TMR_OC_Start_DMA(TMR_HandleTypeDef *htmr, uint32_t Channel, uint32_t *pData, uint16_t Length);
DAL_StatusTypeDef DAL_TMR_OC_Stop_DMA(TMR_HandleTypeDef *htmr, uint32_t Channel);
/**
  * @}
  */

/** @addtogroup TMR_Exported_Functions_Group3 TMR PWM functions
  *  @brief   TMR PWM functions
  * @{
  */
/* Timer PWM functions ********************************************************/
DAL_StatusTypeDef DAL_TMR_PWM_Init(TMR_HandleTypeDef *htmr);
DAL_StatusTypeDef DAL_TMR_PWM_DeInit(TMR_HandleTypeDef *htmr);
void DAL_TMR_PWM_MspInit(TMR_HandleTypeDef *htmr);
void DAL_TMR_PWM_MspDeInit(TMR_HandleTypeDef *htmr);
/* Blocking mode: Polling */
DAL_StatusTypeDef DAL_TMR_PWM_Start(TMR_HandleTypeDef *htmr, uint32_t Channel);
DAL_StatusTypeDef DAL_TMR_PWM_Stop(TMR_HandleTypeDef *htmr, uint32_t Channel);
/* Non-Blocking mode: Interrupt */
DAL_StatusTypeDef DAL_TMR_PWM_Start_IT(TMR_HandleTypeDef *htmr, uint32_t Channel);
DAL_StatusTypeDef DAL_TMR_PWM_Stop_IT(TMR_HandleTypeDef *htmr, uint32_t Channel);
/* Non-Blocking mode: DMA */
DAL_StatusTypeDef DAL_TMR_PWM_Start_DMA(TMR_HandleTypeDef *htmr, uint32_t Channel, uint32_t *pData, uint16_t Length);
DAL_StatusTypeDef DAL_TMR_PWM_Stop_DMA(TMR_HandleTypeDef *htmr, uint32_t Channel);
/**
  * @}
  */

/** @addtogroup TMR_Exported_Functions_Group4 TMR Input Capture functions
  *  @brief   TMR Input Capture functions
  * @{
  */
/* Timer Input Capture functions **********************************************/
DAL_StatusTypeDef DAL_TMR_IC_Init(TMR_HandleTypeDef *htmr);
DAL_StatusTypeDef DAL_TMR_IC_DeInit(TMR_HandleTypeDef *htmr);
void DAL_TMR_IC_MspInit(TMR_HandleTypeDef *htmr);
void DAL_TMR_IC_MspDeInit(TMR_HandleTypeDef *htmr);
/* Blocking mode: Polling */
DAL_StatusTypeDef DAL_TMR_IC_Start(TMR_HandleTypeDef *htmr, uint32_t Channel);
DAL_StatusTypeDef DAL_TMR_IC_Stop(TMR_HandleTypeDef *htmr, uint32_t Channel);
/* Non-Blocking mode: Interrupt */
DAL_StatusTypeDef DAL_TMR_IC_Start_IT(TMR_HandleTypeDef *htmr, uint32_t Channel);
DAL_StatusTypeDef DAL_TMR_IC_Stop_IT(TMR_HandleTypeDef *htmr, uint32_t Channel);
/* Non-Blocking mode: DMA */
DAL_StatusTypeDef DAL_TMR_IC_Start_DMA(TMR_HandleTypeDef *htmr, uint32_t Channel, uint32_t *pData, uint16_t Length);
DAL_StatusTypeDef DAL_TMR_IC_Stop_DMA(TMR_HandleTypeDef *htmr, uint32_t Channel);
/**
  * @}
  */

/** @addtogroup TMR_Exported_Functions_Group5 TMR One Pulse functions
  *  @brief   TMR One Pulse functions
  * @{
  */
/* Timer One Pulse functions **************************************************/
DAL_StatusTypeDef DAL_TMR_OnePulse_Init(TMR_HandleTypeDef *htmr, uint32_t OnePulseMode);
DAL_StatusTypeDef DAL_TMR_OnePulse_DeInit(TMR_HandleTypeDef *htmr);
void DAL_TMR_OnePulse_MspInit(TMR_HandleTypeDef *htmr);
void DAL_TMR_OnePulse_MspDeInit(TMR_HandleTypeDef *htmr);
/* Blocking mode: Polling */
DAL_StatusTypeDef DAL_TMR_OnePulse_Start(TMR_HandleTypeDef *htmr, uint32_t OutputChannel);
DAL_StatusTypeDef DAL_TMR_OnePulse_Stop(TMR_HandleTypeDef *htmr, uint32_t OutputChannel);
/* Non-Blocking mode: Interrupt */
DAL_StatusTypeDef DAL_TMR_OnePulse_Start_IT(TMR_HandleTypeDef *htmr, uint32_t OutputChannel);
DAL_StatusTypeDef DAL_TMR_OnePulse_Stop_IT(TMR_HandleTypeDef *htmr, uint32_t OutputChannel);
/**
  * @}
  */

